#ifndef COMMON_H_
#define COMMON_H_

#include "include_asm.h"

#include "libcdvd.h"

typedef unsigned int size_t;
typedef int ssize_t;
typedef char* caddr_t;
typedef unsigned char u_char;
typedef short unsigned int u_short;
typedef unsigned int u_int;
typedef long unsigned int u_long;
typedef unsigned char unchar;
typedef short unsigned int ushort;
typedef unsigned int uint;
typedef long unsigned int ulong;

void CpuEnableIntr();
void CpuDisableIntr();
void EnableIntr(int);

enum KernelErrorCode {
    KE_OK = 0,
    KE_ERROR = -1,
    KE_ILLEGAL_EXPCODE = -50,
    KE_EXPHANDLER_NOUSE = -51,
    KE_EXPHANDLER_USED = -52,
    KE_ILLEGAL_CONTEXT = -100,
    KE_ILLEGAL_INTRCODE = -101,
    KE_CPUDI = -102,
    KE_INTRDISABLE = -103,
    KE_FOUND_HANDLER = -104,
    KE_NOTFOUND_HANDLER = -105,
    KE_NO_TIMER = -150,
    KE_ILLEGAL_TIMERID = -151,
    KE_ILLEGAL_SOURCE = -152,
    KE_ILLEGAL_PRESCALE = -153,
    KE_TIMER_BUSY = -154,
    KE_TIMER_NOT_SETUP = -155,
    KE_TIMER_NOT_INUSE = -156,
    KE_UNIT_USED = -160,
    KE_UNIT_NOUSE = -161,
    KE_NO_ROMDIR = -162,
    KE_LINKERR = -200,
    KE_ILLEGAL_OBJECT = -201,
    KE_UNKNOWN_MODULE = -202,
    KE_NOFILE = -203,
    KE_FILEERR = -204,
    KE_MEMINUSE = -205,
    KE_NO_MEMORY = -400,
    KE_ILLEGAL_ATTR = -401,
    KE_ILLEGAL_ENTRY = -402,
    KE_ILLEGAL_PRIORITY = -403,
    KE_ILLEGAL_STACK_SIZE = -404,
    KE_ILLEGAL_MODE = -405,
    KE_ILLEGAL_THID = -406,
    KE_UNKNOWN_THID = -407,
    KE_UNKNOWN_SEMID = -408,
    KE_UNKNOWN_EVFID = -409,
    KE_UNKNOWN_MBXID = -410,
    KE_UNKNOWN_VPLID = -411,
    KE_UNKNOWN_FPLID = -412,
    KE_DORMANT = -413,
    KE_NOT_DORMANT = -414,
    KE_NOT_SUSPEND = -415,
    KE_NOT_WAIT = -416,
    KE_CAN_NOT_WAIT = -417,
    KE_RELEASE_WAIT = -418,
    KE_SEMA_ZERO = -419,
    KE_SEMA_OVF = -420,
    KE_EVF_COND = -421,
    KE_EVF_MULTI = -422,
    KE_EVF_ILPAT = -423,
    KE_MBOX_NOMSG = -424,
    KE_WAIT_DELETE = -425,
    KE_ILLEGAL_MEMBLOCK = -426,
    KE_ILLEGAL_MEMSIZE = -427
};

struct _libhead { // 0x14
    /* 0x00 */ struct _libhead* next;
    /* 0x04 */ struct _libcaller* client;
    /* 0x08 */ short unsigned int version;
    /* 0x0a */ short unsigned int flags;
    /* 0x0c */ char name[8];
};

typedef struct _libhead libhead;

struct _libcaller { // 0x14
    /* 0x00:00 */ long unsigned int magic : 32;
    /* 0x04 */ struct _libcaller* client;
    /* 0x08 */ short unsigned int version;
    /* 0x0a */ short unsigned int flags;
    /* 0x0c */ char name[8];
};

typedef struct _libcaller libcaller;

struct _moduleinfo { // 0x8
    /* 0x0 */ char* name;
    /* 0x4 */ short unsigned int version;
};

typedef struct _moduleinfo ModuleInfo;

struct _libinfo { // 0x14
    /* 0x00 */ long unsigned int dummy[2];
    /* 0x08 */ short unsigned int version;
    /* 0x0a */ short unsigned int dummy2;
    /* 0x0c */ char name[8];
};

typedef struct _libinfo LibInfo;

enum EXCEP {
    EXCEP_Int = 0,
    EXCEP_MOD = 1,
    EXCEP_TLBL = 2,
    EXCEP_TLBS = 3,
    EXCEP_AdEL = 4,
    EXCEP_AdES = 5,
    EXCEP_IBE = 6,
    EXCEP_DBE = 7,
    EXCEP_Sys = 8,
    EXCEP_Bp = 9,
    EXCEP_RI = 10,
    EXCEP_CpU = 11,
    EXCEP_Ovf = 12,
    EXCEP_reserv1 = 13,
    EXCEP_reserv2 = 14,
    EXCEP_HDB = 15,
    EXCEP_MAX = 16
};

enum INUM {
    INUM_VBLANK = 0,
    INUM_GM = 1,
    INUM_CDROM = 2,
    INUM_DMA = 3,
    INUM_RTC0 = 4,
    INUM_RTC1 = 5,
    INUM_RTC2 = 6,
    INUM_SIO0 = 7,
    INUM_SIO1 = 8,
    INUM_SPU = 9,
    INUM_PIO = 10,
    INUM_EVBLANK = 11,
    INUM_DVD = 12,
    INUM_PCMCIA = 13,
    INUM_RTC3 = 14,
    INUM_RTC4 = 15,
    INUM_RTC5 = 16,
    INUM_SIO2 = 17,
    INUM_HTR0 = 18,
    INUM_HTR1 = 19,
    INUM_HTR2 = 20,
    INUM_HTR3 = 21,
    INUM_USB = 22,
    INUM_EXTR = 23,
    INUM_FWRE = 24,
    INUM_FDMA = 25,
    INUM_DMA_0 = 32,
    INUM_DMA_1 = 33,
    INUM_DMA_2 = 34,
    INUM_DMA_3 = 35,
    INUM_DMA_4 = 36,
    INUM_DMA_5 = 37,
    INUM_DMA_6 = 38,
    INUM_DMA_BERR = 39,
    INUM_DMA_7 = 40,
    INUM_DMA_8 = 41,
    INUM_DMA_9 = 42,
    INUM_DMA_10 = 43,
    INUM_DMA_11 = 44,
    INUM_DMA_12 = 45,
    INUM_MAX = 64
};

enum {
    SE_ADDRNO_STATIC = 0,
    SE_ADDRNO_BTLHIT = 1,
    SE_ADDRNO_VOICE = 2,
    SE_ADDRNO_DOOR0 = 3,
    SE_ADDRNO_DOOR1 = 4,
    SE_ADDRNO_DOOR2 = 5,
    SE_ADDRNO_FOOT0 = 6,
    SE_ADDRNO_FOOT1 = 7,
    SE_ADDRNO_FOOT2 = 8,
    SE_ADDRNO_FOOT3 = 9,
    SE_ADDRNO_FOOT4 = 10,
    SE_ADDRNO_FOOT5 = 11,
    SE_ADDRNO_FOOT6 = 12,
    SE_ADDRNO_FOOT7 = 13,
    SE_ADDRNO_SRUND0 = 14,
    SE_ADDRNO_SRUND1 = 15,
    SE_ADDRNO_GHOST0 = 16,
    SE_ADDRNO_GHOST1 = 17,
    SE_ADDRNO_GHOST2 = 18,
    SE_ADDRNO_EVENT0 = 19,
    SE_ADDRNO_EVENT1 = 20,
    SE_ADDRNO_WIDE = 21,
    SE_ADDRNO_JIDOU0 = 22,
    SE_ADDRNO_JIDOU1 = 23,
    SE_ADDRNO_JIDOU2 = 24,
    SE_ADDRNO_JIDOU3 = 25,
    SE_ADDRNO_SB0 = 26,
    SE_ADDRNO_ADPCM0 = 27,
    SE_ADDRNO_SB1 = 28,
    SE_ADDRNO_ADPCM1 = 29,
    SE_CSR0 = 0,
    SE_CLIC = 1,
    SE_CLIC_NO = 2,
    SE_CANCEL = 3,
    SE_CSR1 = 4,
    SE_SEALING = 5,
    SE_USEITEM = 6,
    SE_SOUL_APR = 7,
    SE_SOUL_LOOP = 8,
    SE_CAMSUB_00 = 9,
    SE_CAMSUB_01 = 12,
    SE_CAMSUB_02 = 13,
    SE_CAMSUB_03 = 24,
    SE_COME_OUT = 10,
    SE_GETITEM = 11,
    SE_STAMINA_UP = 14,
    SE_TERROR = 15,
    SE_PHOTO = 16,
    SE_DRAIN = 17,
    SE_CHARGE = 18,
    SE_FLASH_CHARGE = 255,
    SE_PUNT = 19,
    SE_SHUTTER = 20,
    SE_SPOUT_LOW = 21,
    SE_SPOUT_MDL = 22,
    SE_SPOUT_HI = 23,
    SE_RARE0 = 27,
    SE_RARE1 = 28,
    SE_ENE_PURIFY = 29,
    SE_ENE0_GRASP = 30,
    SE_ENE0_WARP = 31,
    SE_ENE0_HIT = 32,
    SE_TOUSHU_KIRI = 32,
    SE_TOUSHU_KAZEKIRI = 31,
    SE_PLYR_DMG0 = 33,
    SE_PLYR_DMG1 = 34,
    SE_PLYR_DMG2 = 35,
    SE_PLYR_DEADLY = 36,
    SE_PLYR_DEADLY2 = 255,
    SE_PUZZLE0 = 33,
    SE_PUZZLE1 = 34,
    SE_PUZZLE2 = 35,
    SE_PUZZLE3 = 36,
    SE_PUZZLE4 = 37,
    SE_MN0 = 33,
    SE_MN1 = 34,
    SE_MN2 = 35,
    SE_MN3 = 36,
    SE_MN4 = 37,
    SE_DOOR_OPN_00 = 38,
    SE_DOOR_CLS_00 = 39,
    SE_DOOR_OPN_01 = 40,
    SE_DOOR_CLS_01 = 41,
    SE_DOOR_OPN_02 = 42,
    SE_DOOR_CLS_02 = 43,
    SE_FOOT0 = 44,
    SE_FOOT1 = 45,
    SE_FOOT2 = 46,
    SE_FOOT3 = 47,
    SE_FOOT4 = 48,
    SE_FOOT5 = 49,
    SE_FOOT6 = 50,
    SE_FOOT7 = 51,
    SE_SURROUND0 = 52,
    SE_SURROUND1 = 53,
    SE_ENE0_OMEN = 54,
    SE_ENE0_APPROACH = 55,
    SE_ENE0_FLINCH_LOW = 56,
    SE_ENE0_FLINCH_MDL = 57,
    SE_ENE0_FLINCH_HI = 58,
    SE_ENE0_ATACK = 59,
    SE_ENE0_DEATH = 60,
    SE_ENE0_SPE0 = 61,
    SE_ENE0_SPE1 = 62,
    SE_ENE0_SPE2 = 63,
    SE_ENE0_SPE3 = 64,
    SE_ENE1_OMEN = 65,
    SE_ENE1_APPROACH = 66,
    SE_ENE1_FLINCH_LOW = 67,
    SE_ENE1_FLINCH_MDL = 68,
    SE_ENE1_FLINCH_HI = 69,
    SE_ENE1_ATACK = 70,
    SE_ENE1_DEATH = 71,
    SE_ENE1_SPE0 = 72,
    SE_ENE1_SPE1 = 73,
    SE_ENE1_SPE2 = 74,
    SE_ENE1_SPE3 = 75,
    SE_ENE2_OMEN = 76,
    SE_ENE2_APPROACH = 77,
    SE_ENE2_FLINCH_LOW = 78,
    SE_ENE2_FLINCH_MDL = 79,
    SE_ENE2_FLINCH_HI = 80,
    SE_ENE2_ATACK = 81,
    SE_ENE2_DEATH = 82,
    SE_ENE2_SPE0 = 83,
    SE_ENE2_SPE1 = 84,
    SE_ENE2_SPE2 = 85,
    SE_ENE2_SPE3 = 86,
    SE_EVENT_00 = 87,
    SE_EVENT_01 = 88,
    SE_EVENT_02 = 89,
    SE_EVENT_10 = 90,
    SE_EVENT_11 = 91,
    SE_EVENT_12 = 92,
    SE_HANYOU = 93,
    SE_ENE_JIDOU0 = 94,
    SE_ENE_JIDOU1 = 95,
    SE_ENE_JIDOU2 = 96,
    SE_ENE_JIDOU3 = 97,
    SE_NO = 255,
    SE_TMP_KOTO0 = 81,
    SE_TMP_KOTO1 = 82,
    SE_TMP_JREI001 = 255,
    SE_TMP_JREI104 = 255,
    SE_TMP_JREI109 = 255,
    SE_TMP_JREI110 = 255,
    SE_ENE0_FLINCH = 51,
    SE_DOOR_SP_OPN = 31,
    SE_DOOR_SP_CLS = 32,
    SE_DOOR_LG_LCK = 33,
    SE_UNLOCK_MD = 36,
    SE_DOOR_LG_OPN = 26,
    SE_DOOR_LG_CLS = 27,
    SE_DOOR_MD_OPN = 28,
    SE_DOOR_MD_CLS = 29,
    SE_FUSUMA_OPN = 30
};

enum IOP_STEREO_SET {
    IS_STEREO = 0,
    IS_MONAURAL = 1
};

enum IOP_COMMAND_ID {
    IC_COM_NOTHING = 0,
    IC_SE_INIT = 1,
    IC_SE_PLAY = 2,
    IC_SE_POS = 3,
    IC_SE_STOP = 4,
    IC_SE_VOL = 5,
    IC_SE_EVOL = 6,
    IC_SE_PITCH = 7,
    IC_SE_ALLSTOP = 8,
    IC_SE_MVOL = 9,
    IC_SE_STE_MONO = 10,
    IC_SE_QUIT = 11,
    IC_CDVD_INIT = 12,
    IC_CDVD_LOAD = 13,
    IC_CDVD_LOAD_SECT = 14,
    IC_CDVD_SEEK = 15,
    IC_CDVD_SE_TRANS = 16,
    IC_CDVD_SE_TRANS_RESET = 17,
    IC_CDVD_BREAK = 18,
    IC_BGM_INIT = 19,
    IC_BGM_PLAY = 20,
    IC_BGM_STOP = 21,
    IC_BGM_PAUSE = 22,
    IC_BGM_RESTART = 23,
    IC_BGM_VOL = 24,
    IC_BGM_QUIT = 25,
    IC_ADPCM_INIT = 26,
    IC_ADPCM_PLAY = 27,
    IC_ADPCM_PRELOAD = 28,
    IC_ADPCM_LOADEND_PLAY = 29,
    IC_ADPCM_STOP = 30,
    IC_ADPCM_PAUSE = 31,
    IC_ADPCM_RESTART = 32,
    IC_ADPCM_FADE_VOL = 33,
    IC_ADPCM_POS = 34,
    IC_ADPCM_MVOL = 35,
    IC_ADPCM_SET_SPU2IRQ = 36,
    IC_ADPCM_QUIT = 37
};

enum IOP_CMD_MODE {
    ICM_INIT = 0,
    ICM_REQ = 1,
    ICM_GET_STAT_ONLY = 2
};

enum TRANS_MEM_TYPE {
    TRANS_MEM_EE = 0,
    TRANS_MEM_IOP = 1,
    TRANS_MEM_SPU = 2,
    TRANS_PCM = 3,
    TRANS_MEM_NUM = 4
};

typedef struct { // 0x8
    /* 0x0 */ int file_no;
    /* 0x4 */ u_char stat;
    /* 0x5 */ u_char renew;
} CDVD_LOAD_STAT;

enum CDVD_LOAD_STATUS {
    CDVD_LS_FINISHED = 0,
    CDVD_LS_WAIT = 1,
    CDVD_LS_TRANS = 2,
    CDVD_LS_TRANS_END = 3,
    CDVD_LS_LOADING = 4
};

enum CDVD_SE_TRANS_STATUS {
    CDVD_SE_NOCMD = 0,
    CDVD_SE_WAIT = 1,
    CDVD_SE_FINISHED = 2
};

typedef struct { // 0x10c
    /* 0x000 */ CDVD_LOAD_STAT fstat[32];
    /* 0x100 */ int stat;
    /* 0x100 */ u_int ld_addr;
    /* 0x108 */ int se_trans;
} CDVD_RET_STAT;

typedef struct { // 0x4
    /* 0x0 */ int status;
} SE_VSTAT;

typedef struct { // 0x8
    /* 0x0 */ int thread_id;
    /* 0x4 */ int stat;
} BGM_STAT;

typedef struct { // 0x8
    /* 0x0 */ short int status;
    /* 0x2 */ short int tune_no;
    /* 0x4 */ int count;
} ADPCM_STAT;

enum ADPCM_PLAY_STAT {
    ADPCM_STAT_NOPLAY = 0,
    ADPCM_STAT_FULL_STOP = 1,
    ADPCM_STAT_LOOPEND_STOP = 2,
    ADPCM_STAT_PRELOAD = 3,
    ADPCM_STAT_PRELOAD_TRANS = 4,
    ADPCM_STAT_PRELOAD_END = 5,
    ADPCM_STAT_PLAY = 6,
    ADPCM_STAT_LTRANS = 7,
    ADPCM_STAT_RTRANS = 8,
    ADPCM_STAT_PAUSE = 9,
    ADPCM_STAT_ERROR = -1
};

typedef struct { // 0x180
    /* 0x000 */ SE_VSTAT sev_stat[24];
    /* 0x060 */ BGM_STAT bgm;
    /* 0x068 */ CDVD_RET_STAT cdvd;
    /* 0x174 */ ADPCM_STAT adpcm;
    /* 0x17c */ int dummy[1];
} IOP_STAT;

typedef struct { // 0x20
    /* 0x00 */ int cmd_no;
    /* 0x04 */ int data1;
    /* 0x08 */ int data2;
    /* 0x0c */ int data3;
    /* 0x10 */ int data4;
    /* 0x14 */ int data5;
    /* 0x18 */ int data6;
    /* 0x1c */ int data7;
} IOP_COMMAND;

typedef struct { // 0x414
    /* 0x000 */ int get_cmd[256];
    /* 0x400 */ int cmd_num;
    /* 0x404 */ int timer_id;
    /* 0x408 */ int thread_id;
    /* 0x40c */ int adpcm_thid;
    /* 0x410 */ unsigned int count;
} IOP_SYS_CTRL;

typedef struct { // 0x4
    /* 0x0 */ u_short vol;
    /* 0x2 */ u_char mono;
} IOP_MASTER_VOL;

typedef struct { // 0x10
    /* 0x0 */ unsigned int adrs;
    /* 0x4 */ short unsigned int attribute;
    /* 0x6 */ short unsigned int pitch;
    /* 0x8 */ short unsigned int adsr1;
    /* 0xa */ short unsigned int adsr2;
    /* 0xc */ char efct;
    /* 0xd */ char vol;
    /* 0xe */ char pan;
} SE_PARAM;

typedef struct { // 0x20
    /* 0x00 */ SE_PARAM* param;
    /* 0x00 */ unsigned int attribute;
    /* 0x08 */ short int v_no;
    /* 0x0a */ short int prm_no;
    /* 0x0c */ short unsigned int pitch;
    /* 0x0e */ short unsigned int vol_l;
    /* 0x10 */ short unsigned int vol_r;
    /* 0x12 */ short unsigned int adsr1;
    /* 0x14 */ short unsigned int adsr2;
    /* 0x16 */ short unsigned int tgt_vol_l;
    /* 0x18 */ short unsigned int tgt_vol_r;
    /* 0x1a */ char inc_vol_l;
    /* 0x1b */ char inc_vol_r;
    /* 0x1c */ unsigned char buf_no;
} SE_WRK_SET;

typedef struct { // 0x32
    /* 0x00 */ short int btlhit;
    /* 0x02 */ short int voice;
    /* 0x04 */ short int door[3];
    /* 0x0a */ short int foot[8];
    /* 0x1a */ short int srund[2];
    /* 0x1e */ short int ghost[3];
    /* 0x24 */ short int event[2];
    /* 0x28 */ short int wide;
    /* 0x2a */ short int jidou[4];
} SE_START_POINT;

enum SE_VOICE_STAT {
    VOICE_FREE = 0,
    VOICE_USE = 1,
    VOICE_LOOP = 2,
    VOICE_RESERVED = 3
};

typedef struct { // 0x2c
    /* 0x00:00 */ unsigned int fsize : 32;
    /* 0x00:32 */ unsigned int asize : 32;
    /* 0x00:64 */ unsigned int offset : 32;
    /* 0x00:96 */ unsigned int pos : 32;
    /* 0x10 */ int pcm_no;
    /* 0x14 */ int intr;
    /* 0x18 */ int file;
    /* 0x1c */ short int vol_reg;
    /* 0x20 */ char* buf;
    /* 0x24 */ unsigned char stat;
    /* 0x25 */ char pre_load;
    /* 0x26 */ char vol;
    /* 0x27 */ char dbufid;
    /* 0x28 */ char loop;
} IOP_PCM;

enum IOP_PCM_STAT {
    IPS_IDOL = 0,
    IPS_PRELOAD = 1,
    IPS_PRELOADED = 2,
    IPS_PLAY = 3,
    IPS_PAUSE = 4,
    IPS_LOAD = 5,
    IPS_STOP = 6
};

typedef struct { // 0x60
    /* 0x00 */ int thread_id;
    /* 0x04 */ int first;
    /* 0x08 */ int start;
    /* 0x0c */ int szFile_bk;
    /* 0x10 */ int szFile;
    /* 0x14 */ int str_pos;
    /* 0x18 */ int str_lpos;
    /* 0x1c */ int str_tpos;
    /* 0x20 */ int lreq_size;
    /* 0x24 */ int pos;
    /* 0x28 */ int dbidi;
    /* 0x2c */ int dbids;
    /* 0x30 */ int fade_count;
    /* 0x34 */ int fade_flm;
    /* 0x38 */ int count;
    /* 0x3c */ int stop_cnt;
    /* 0x40 */ short int tune_no;
    /* 0x42 */ u_short target_vol;
    /* 0x44 */ u_short vol;
    /* 0x46 */ u_short pan;
    /* 0x48 */ u_short vol_ll;
    /* 0x4a */ u_short vol_lr;
    /* 0x4c */ u_short vol_rl;
    /* 0x4e */ u_short vol_rr;
    /* 0x50 */ u_short pitch;
    /* 0x52 */ u_short core;
    /* 0x54 */ u_short vl;
    /* 0x56 */ u_short vr;
    /* 0x58 */ u_char fade_mode;
    /* 0x59 */ u_char use;
    /* 0x5a */ u_char stat;
    /* 0x5b */ u_char load_type;
    /* 0x5c */ u_char loop;
    /* 0x5d */ u_char loop_end;
} IOP_ADPCM;

typedef struct { // 0x20
    /* 0x00 */ int first;
    /* 0x04 */ int size;
    /* 0x08 */ int start_cnt;
    /* 0x0c */ u_short fade_flm;
    /* 0x0e */ u_short tune_no;
    /* 0x10 */ u_short vol;
    /* 0x12 */ u_short start_vol;
    /* 0x14 */ u_short target_vol;
    /* 0x16 */ u_short pan;
    /* 0x18 */ u_short pitch;
    /* 0x1a */ u_char cmd_type;
    /* 0x1b */ u_char loop;
    /* 0x1c */ u_char channel;
    /* 0x1d */ u_char fade_mode;
} ADPCM_CMD;

enum ADPCM_FADE_MODE {
    ADPCM_FADE_NO = 0,
    ADPCM_FADE_IN_PLAY = 1,
    ADPCM_FADE_OUT_STOP = 2,
    ADPCM_FADE = 3
};

typedef struct { // 0x20
    /* 0x00 */ int req_type;
    /* 0x04 */ int file_no;
    /* 0x08 */ int start_sector;
    /* 0x0c */ int size_sector;
    /* 0x10 */ int size_byte;
    /* 0x10:32 */ u_int id : 32;
    /* 0x18 */ u_int* taddr;
    /* 0x1c */ u_char se_buf_no;
    /* 0x1d */ u_char tmem;
} CDVD_REQ_BUF;

typedef struct { // 0x10
    /* 0x0 */ u_int* taddr;
    /* 0x4 */ int start;
    /* 0x8 */ int file_no;
    /* 0xc */ int size_now;
} CDVD_PCM;

typedef struct { // 0x18
    /* 0x00 */ u_int* taddr;
    /* 0x04 */ int start;
    /* 0x08 */ int file_no;
    /* 0x0c */ int size_now;
    /* 0x10 */ int read_now;
    /* 0x14 */ u_char req_type;
    /* 0x15 */ u_char call_play;
    /* 0x16 */ u_char endld_flg;
    /* 0x17 */ u_char now_load;
} CDVD_ADPCM;

typedef struct { // 0xc
    /* 0x0 */ int id;
    /* 0x4 */ int tid;
    /* 0x8 */ u_char ltrans;
    /* 0x9 */ u_char stat;
    /* 0xa */ u_char tmem;
} CDVD_TRANS_STAT;

typedef struct { // 0x94
    /* 0x00 */ sceCdRMode rmode;
    /* 0x04 */ sceCdlFILE cdlf;
    /* 0x28 */ CDVD_PCM pcm;
    /* 0x38 */ CDVD_ADPCM adpcm[2];
    /* 0x60:64 */ u_int ctime : 32;
    /* 0x6c */ int stat;
    /* 0x70 */ int start;
    /* 0x74 */ int id;
    /* 0x78 */ int file_no;
    /* 0x7c */ int size;
    /* 0x80 */ int now_size;
    /* 0x84 */ int end_size;
    /* 0x88 */ u_char start_pos;
    /* 0x89 */ u_char req_pos;
    /* 0x8a */ u_char buf_use_num;
    /* 0x8b */ u_char now_lbuf;
    /* 0x8c */ u_char cmd_on;
    /* 0x8d */ u_char vtrans_flg;
    /* 0x8e */ u_char adpcm_req;
    /* 0x8f */ u_char pcm_req;
    /* 0x90 */ u_char pcm_pre;
    /* 0x91 */ u_char pcm_pre_end;
    /* 0x92 */ u_char error_cnt;
} CDVD_STAT;

enum CDVD_STATUS {
    CDVD_STAT_FREE = 0,
    CDVD_STAT_LOADING = 1,
    CDVD_STAT_STREAMING = 2,
    CDVD_STAT_TRANS_WAIT = 3,
    CDVD_STAT_SEEKING = 4
};

enum ADPCM_LOADREQ_TYPE {
    ADPCM_LDREQ_NO = 0,
    ADPCM_LDREQ_PRELOAD_ONLY = 1,
    ADPCM_LDREQ_STREAM = 2
};

typedef signed char s_char;
typedef short int s_short;
typedef long int s_long;

enum GAME_MODE {
    GAME_MODE_INIT = 0,
    GAME_MODE_MCCHECK = 1,
    GAME_MODE_OUTGAME = 2,
    GAME_MODE_INGAME = 3
};

enum GAME_MODE_CHANGE {
    GMC_OUT_MENU_IN = 0,
    GMC_IN_GAMEOVER_OUT = 1,
    GMC_IN_GAMECLEAR_OUT = 2,
    GMC_IN_GAMERETIRE_OUT = 3
};

enum {
    INGAME_MODE_FIRST_LOAD = 0,
    INGAME_MODE_INIT = 1,
    INGAME_MODE_WAIT = 2,
    INGAME_MODE_NEW_GAME = 3,
    INGAME_MODE_LOAD_START = 4,
    INGAME_MODE_MSN_TITLE = 5,
    INGAME_MODE_NOMAL = 6,
    INGAME_MODE_EVENT = 7,
    INGAME_MODE_SPECIAL_EVENT = 8,
    INGAME_MODE_AREA_MOVE = 9,
    INGAME_MODE_MENU = 10,
    INGAME_MODE_PAUSE = 11,
    INGAME_MODE_SPD_MAP = 12,
    INGAME_MODE_SPD_OPT = 13,
    INGAME_MODE_GET_ITEM = 14,
    INGAME_MODE_WANDER_SOUL = 15,
    INGAME_MODE_SAVE_POINT = 16,
    INGAME_MODE_PHOTO_AFTER = 17,
    INGAME_MODE_GHOST_DEAD = 18,
    INGAME_MODE_SGST_DISP = 19,
    INGAME_MODE_GAME_OVER = 20,
    INGAME_MODE_GAME_OVER_ALBUM = 21,
    INGAME_MODE_INTER_MSN = 22,
    INGAME_MODE_ENDING = 23,
    INGAME_MODE_WAIT_MSN0 = 24
};

enum {
    OG_TITLE_MODE = 0,
    OG_LOADGAME_MODE = 1,
    OG_OPTION_MODE = 2,
    OG_ALBUM_MODE = 3,
    OG_MOVIE_MODE = 4,
    OG_DEMOPLAY_MODE = 5,
    OG_NAME_ENTRY_MODE = 6,
    OG_MAPDATA_EDIT_MODE = 7,
    OG_SOUND_TEST_MODE = 8,
    OG_SCENE_TEST_MODE = 9,
    OG_MOTION_TEST_MODE = 10,
    OG_2D_TEST_MODE = 11
};

enum OUTGAME_MODE {
    OUTGAME_MODE_INIT = 0,
    OUTGAME_MODE_WAIT = 1,
    OUTGAME_MODE_LOGO = 2,
    OUTGAME_MODE_TITLE_TOP = 3,
    OUTGAME_MODE_TITLE = 4,
    OUTGAME_MODE_ALBUM = 5,
    OUTGAME_MODE_BATTLE = 6,
    OUTGAME_MODE_OPTION = 7,
    OUTGAME_MODE_MODESEL = 8,
    OUTGAME_MODE_MAP_DATA_EDIT = 9,
    OUTGAME_MODE_SOUND_TEST = 10,
    OUTGAME_MODE_SCENE_TEST = 11,
    OUTGAME_MODE_MOTION_TEST = 12,
    OUTGAME_MODE_ROOM_SIZE_CHECK = 13,
    OUTGAME_MODE_LAYOUT_TEST = 14,
    OUTGAME_MODE_DBG_MAX = 9,
    OUTGAME_MODE_DBG_STORY_MODE = 5
};

enum TITLE_MODE {
    TITLE_INIT = 0,
    TITLE_WAIT = 1,
    TITLE_TITLE = 2,
    TITLE_TITLE_WAIT = 3,
    TITLE_TITLE_WAIT2 = 4,
    TITLE_TITLE_SEL = 5,
    TITLE_LOAD_PRE = 6,
    TITLE_MEMCA_LOAD_WAIT = 7,
    TITLE_MEMCA_LOAD = 8,
    TITLE_MODE_SEL = 9,
    TITLE_DIFF_SEL = 10,
    TITLE_INIT_FROM_IN = 11,
    TITLE_WAIT_FROM_IN = 12,
    TITLE_MODE_SELECT = 13,
    TITLE_ALBM_LOAD_PRE = 14,
    TITLE_ALBM_LOAD1 = 15,
    TITLE_ALBM_LOAD2 = 16,
    TITLE_ALBM_MAIN_PRE = 17,
    TITLE_ALBM_MAIN = 18,
    TITLE_ALBM_SAVE_PRE = 19,
    TITLE_ALBM_SAVE = 20,
    TITLE_ALBM_LOAD_MODE_PRE = 21,
    TITLE_ALBM_LOAD_MODE = 22,
    TITLE_TITLE_SEL_INIT = 23,
    TITLE_TITLE_SEL_BGMREQ = 24,
    TITLE_ALBM_LOAD0 = 25,
    TITLE_INIT_FROM_IN_BGMREQ = 26,
    TITLE_MODE_SEL_BGMREQ = 27,
    TITLE_MOVIE_STEP1 = 28,
    TITLE_MOVIE_STEP2 = 29,
    TITLE_MOVIE_STEP3 = 30
};

enum {
    NUM_TYPE_R = 0,
    NUM_TYPE_L = 1,
    NUM_TYPE_Z = 2
};

enum MOVIE_STAT {
    MOVIE_STAT_NOPLAY = 0,
    MOVIE_STAT_WAIT1 = 1,
    MOVIE_STAT_WAIT2 = 2,
    MOVIE_STAT_PLAY_MPEG = 3,
    MOVIE_STAT_END1 = 4,
    MOVIE_STAT_END2 = 5,
    MOVIE_STAT_TEST = 6,
    MOVIE_STAT_LOGO = 7
};

enum {
    ZERO_CHAPTER0 = 0,
    ZERO_CHAPTER1 = 1,
    ZERO_CHAPTER2 = 2,
    ZERO_CHAPTER3 = 3,
    ZERO_CHAPTER4 = 4,
    ZERO_CHAPTER5 = 5,
    ZERO_CHAPTER_MAX = 6,
    ZERO_MISSION0 = 1,
    ZERO_MISSION1 = 2,
    ZERO_MISSION2 = 3,
    ZERO_MISSION3 = 4,
    ZERO_MISSION4 = 5,
    ZERO_MISSION5 = 6,
    ZERO_MISSION_MAX = 7
};

enum MAP_FLOOR_LBL {
    MAP_FLOOR_B1 = 0,
    MAP_FLOOR_F1 = 1,
    MAP_FLOOR_F2 = 2,
    MAP_FLOOR_F3 = 3,
    MAP_FLOOR_MAX = 4
};

enum MAP_TYPE_CODE {
    MAP_ROOM_DAT = 0,
    MAP_CAMERA = 1,
    MAP_CAMERA_B = 2,
    MAP_CAMERA_D = 3,
    MAP_HEIGHT = 4,
    MAP_HIT_CHECK = 5,
    MAP_REQ_EVENT = 6,
    MAP_REQ_SE = 7,
    MAP_FIND_DAT = 8,
    MAP_DOOR_DAT = 9,
    MAP_FURNITUR = 10,
    MAP_MOVE_MOT = 11
};

enum {
    EW_JIBAKU1 = 0,
    EW_JIBAKU2 = 1,
    EW_FUYU = 2,
    EW_AUTO = 3
};

enum {
    CK_NORMAL = 0,
    CK_BATTLE = 1,
    CK_DRAMA = 2,
    CK_DOOR = 3,
    CK_MAX = 4
};

enum {
    FILE_TYPE_END = 0,
    FILE_TYPE_DAT = 1,
    FILE_TYPE_SE = 2,
    FILE_TYPE_CAM_DAT = 3,
    FILE_TYPE_CAM_DAT2 = 4,
    FILE_TYPE_CAM_DAT3 = 5,
    FILE_TYPE_CAM_DAT4 = 6,
    FILE_TYPE_MAP_DAT = 7,
    FILE_TYPE_ENE_MDL = 8,
    FILE_TYPE_BENE_MOT = 9,
    FILE_TYPE_ENE_MOT = 10,
    FILE_TYPE_ITM_MDL = 11,
    FILE_TYPE_ROOM = 12,
    FILE_TYPE_SCENE = 13
};

enum SEBUF_GHOST_CHK {
    SEBUF_GHOST_TYPE = 0,
    SEBUF_GHOST_NO = 1,
    SEBUF_GHOST_CHK_NUM = 2
};

enum ROOM_SE_LOAD_AT_MDL_LOAD {
    RSE_NO_LOAD = 0,
    RSE_ONE_LOAD = 1,
    RSE_NEXT_LOAD = 2
};

enum {
    OPT_KT_ANALOG1 = 0,
    OPT_KT_RADICON1 = 1,
    OPT_KT_ANALOG2 = 2,
    OPT_KT_RADICON2 = 3,
    OPT_KT_ANALOG1R = 4,
    OPT_KT_RADICON1R = 5,
    OPT_KT_ANALOG2R = 6,
    OPT_KT_RADICON2R = 7,
    KEY_TYPE_NUM = 8
};

enum {
    PMODE_NORMAL = 0,
    PMODE_FINDER = 1,
    PMODE_DMG = 2,
    PMODE_FINDER_END = 3,
    PMODE_MSG_DISP = 4,
    PMODE_POSE = 5,
    PMODE_FINDER_IN = 6,
    PMODE_PRE_DMG = 7,
    PMODE_OVERHEAT = 8,
    PMODE_FIN_CAM = 9,
    PMODE_ANIME = 10
};

enum {
    PCT_NORMAL = 0
};

enum {
    PCON_NORMAL = 0,
    PCON_MAHI = 1,
    PCON_KONWAKU = 2,
    PCON_TEBURE = 3,
    PCON_MEKURAMASHI = 4,
    PCON_TEBURE2 = 5
};

enum {
    EBLINK_DATA = 0,
    EARATIO_DATA = 1,
    EACT_NORMAL = 2,
    EACT_CAPTURE = 3,
    EACT_PVIEW = 4,
    EACT_ATK = 5,
    EACT_OUTAREA = 6,
    EACT_DMG = 7,
    EACT_DEL = 8,
    EACT_APPEAR = 9,
    EACT_PUSH = 10,
    EACT_NONE = 255
};

enum {
    PHOTO_MODE_NO_REQ = 0,
    PHOTO_MODE_PRE0 = 1,
    PHOTO_MODE_PRE1 = 2,
    PHOTO_MODE_SCORE = 3,
    PHOTO_MODE_CNG_PHOTO = 4,
    PHOTO_MODE_MAKE_DISP = 5,
    PHOTO_MODE_DISP_WAIT1 = 6,
    PHOTO_MODE_DISP_WAIT2 = 7,
    PHOTO_MODE_CAP = 8,
    PHOTO_MODE_END = 9,
    PHOTO_MODE_AFTER = 10,
    PHOTO_MODE_HINT_LOAD = 11
};

enum {
    SUB_NOTING = 0,
    SUB_KIND_BENE = 1,
    SUB_KIND_FENE = 2,
    SUB_KIND_AENE = 3,
    SUB_KIND_FURN = 4,
    SUB_KIND_RARE = 5,
    SUB_KIND_MAKE = 6
};

enum {
    NOMAL_PHOTO = 0,
    PHOTO_MAKE_MONO = 1,
    PHOTO_MAKE_NO_ITEM = 2,
    PHOTO_MAKE_DARK = 3,
    PHOTO_MAKE_FALTH = 4,
    PHOTO_MAKE_BLURRY = 5,
    PHOTO_MAKE_2DPLUS = 6,
    PHOTO_MAKE_3DPLUS = 7
};

enum {
    EAP_KUBI = 0,
    EAP_KATA = 1,
    EAP_ASHI = 2
};

enum {
    CFSB_NOT = 0,
    CFSB_CLOSE = 1,
    CFSB_OPEN = 2,
    CFSB_EQUIP = 3
};

enum {
    CFSB_NO_PUSH = 0,
    CFSB_NO_SLOW = 1,
    CFSB_NO_VIEW = 2,
    CFSB_NO_STOP = 3,
    CFSB_NO_SEARCH = 4,
    CUSTOM_SB_NUM = 5
};

enum {
    CFSP_NO_DIR = 0,
    CFSP_NO_ASEARCH = 1,
    CFSP_NO_ZOOM = 2,
    CFSP_NO_NFILM = 3,
    CFSP_NO_ZERO = 4,
    CUSTOM_SP_NUM = 5
};

enum {
    GRA2D_CALL_OG = 0,
    GRA2D_CALL_IG0 = 1,
    GRA2D_CALL_IG1 = 2,
    GRA2D_CALL_IG0E = 3,
    GRA2D_CALL_IG1E = 4,
    GRA2D_CALL_IG2 = 5,
    GRA2D_CALL_IG3 = 6,
    GRA2D_CALL_IG31 = 7,
    GRA2D_CALL_IG32 = 8,
    GRA2D_LOAD_FONT = 9,
    GRA2D_CACHE_DRAW = 10,
    GRA2D_RESETDEF = 11
};

enum {
    EF_NULL = 0,
    EF_Z_DEP = 1,
    EF_DITHER = 2,
    EF_BLUR_N = 3,
    EF_BLUR_B = 4,
    EF_BLUR_W = 5,
    EF_DEFORM = 6,
    EF_FOCUS = 7,
    EF_OVERLAP = 8,
    EF_FADEFRAME = 9,
    EF_RENZFLARE = 10,
    EF_BLACKFILTER = 11,
    EF_NEGA = 12,
    EF_NCONTRAST = 13,
    EF_NCONTRAST2 = 14,
    EF_NCONTRAST3 = 15,
    EF_MAGATOKI = 16,
    EF_ENEDMG1 = 17,
    EF_ENEDMG2 = 18,
    EF_SPIRIT = 19,
    EF_HALO = 20,
    EF_RIPPLE = 21,
    EF_RIPPLE2 = 22,
    EF_FIRE = 23,
    EF_FIRE2 = 24,
    EF_TORCH = 25,
    EF_SMOKE = 26,
    EF_PDEFORM = 27,
    EF_ENEFIRE = 28,
    EF_DUST = 29,
    EF_WATERDROP = 30,
    EF_SUNSHINE = 31,
    EF_NEGACIRCLE = 32,
    EF_ENEFACE = 33,
    EF_FACESPIRIT = 34,
    EF_DITHER2 = 35,
    EF_Z_DEP2 = 36,
    EF_HAZE = 37,
    EF_PBLUR = 38,
    EF_ENEIN = 39,
    EF_ENEOUT = 40,
    EF_LUMINE = 41,
    EF_STEALTH = 42,
    EF_STEALTH2 = 43,
    EF_007 = 44,
    EF_MONO = 45,
    EF_SEPIA = 46
};

enum {
    SS_GOEMON = 0,
    SS_SYOIN = 1,
    SS_IKESU1 = 2,
    SS_IKESU2 = 3,
    SS_KAIRO1 = 4,
    SS_KAIRO2 = 5,
    SS_KAIDAN = 6,
    SS_END = 7
};

enum {
    R000_GENKAN = 0,
    R001_FUSUMA = 1,
    R002_IZANAI = 2,
    R003_OUSETSU = 3,
    R004 = 4,
    R005 = 5,
    R006_HAKONIWA = 6,
    R007_TOMURAI = 7,
    R008_KAIROU = 8,
    R009_NANDO = 9,
    R010_NINGYO = 10,
    R011_GOIMON = 11,
    R012_IMA = 12,
    R013_ANUTSU = 13,
    R014 = 14,
    R015_KOUJI = 15,
    R016_NAKANIWA = 16,
    R017_KAIDAN = 17,
    R018 = 18,
    R019 = 19,
    R020 = 20,
    R021_URANIWA = 21,
    R022_NAKASU = 22,
    R023_IKESU = 23,
    R024_TSUKIMI = 24,
    R025_SANDO = 25,
    RO26_OYASHIRO = 26,
    R027_WATARI = 27,
    R028 = 28,
    R029 = 29,
    R030 = 30,
    R031 = 31,
    R032 = 32,
    R033 = 33,
    R034 = 34,
    R035 = 35,
    R036 = 36,
    R037 = 37,
    R038_TYOUBOU = 38
};

enum {
    M000_MIKU = 0,
    M001_MAFUYU = 1,
    M002_MONOSAK = 2,
    M003_HENSYU = 3,
    M004_JYOSYU = 4,
    M005_SAKKA = 5,
    M006_KOKIRIE = 6,
    M007_KAZOKU = 7,
    M008_DUMMY = 8,
    M009_HENSHITAI = 9,
    M010_HENREI = 10,
    M011_JYOREI = 11,
    M012_SAKKAREI = 12,
    M013_TENAGA = 13,
    M014_KAMIONNA = 14,
    M015_KOMUSO = 15,
    M016_MINREI = 16,
    M017_KIRIE = 17,
    M018_MAYOIGO1 = 18,
    M019_BOUREI1 = 19,
    M020_SAKASA = 20,
    M021_KUBI = 21,
    M022_MAYOIGO2 = 22,
    M023_MAYOIGO3 = 23,
    M024_MEKAKUSHI = 24,
    M025_RTE = 25,
    M026_MINZOKU = 26,
    M027_KONNA = 27,
    M028_KOTOKO = 28,
    M029_MAYOIGO4 = 29,
    M030_SAKKAGE = 30,
    M031_HAIREI = 31,
    M032_SHINKAN1 = 32,
    M033_MINTSUMA = 33,
    M034_SHINKAN2 = 34,
    M035_SHINKAN3 = 35,
    M036_SHINKAN4 = 36,
    M037_TOUSHU = 37,
    M038_NAWAMIKO = 38,
    M039_MAGONLY = 39,
    M040_MAGATOKI = 40,
    M041_DUMMY = 41,
    M042_SYOUKI2 = 42,
    M043_SYOUKI3 = 43,
    M044_SYOUKI4 = 44,
    M045_DUMMY = 45,
    M046_DUMMY = 46,
    M047_SAKKAN = 47,
    M048_TE = 48,
    M049_HENSYUHAND = 49,
    M050_LTE = 50,
    M051_MKIRIE = 51,
    M052_DUMMY = 52,
    M053_DUMMY = 53,
    M054_DUMMY = 54,
    M055_SYOUALL = 55,
    M056_MINDEAD = 56,
    M057_NAWAKOKI = 57,
    M058_BOUREI2 = 58,
    M059_JITOUSHU = 59,
    M060_TENAKAGE = 60,
    M061_MONOJYO = 61,
    M800_BOUREI1 = 62,
    M801_SAKASA = 63,
    M802_KUBI = 64,
    M803_KONNA = 65,
    M804_KOTOKO = 66,
    M900_ONNRYOU = 67,
    M901_ONNRYOU = 68,
    M902_ONNRYOU = 69,
    MAN_MDL_ID_MAX = 70
};

enum {
    A000_MIKU = 0,
    A001_MAFUYU = 1,
    A010_HENREI = 2,
    A011_JYOREI = 3,
    A012_SAKKAREI = 4,
    A013_TENAGA = 5,
    A014_KAMIONNA = 6,
    A015_KOMUSO = 7,
    A016_MINREI = 8,
    A018_MAYOIGO1 = 9,
    A019_BOUREI1 = 10,
    A020_SAKASA = 11,
    A021_KUBI = 12,
    A022_MAYOIGO2 = 13,
    A023_MAYOIGO3 = 14,
    A024_MEKAKUSHI = 15,
    A025_RTE = 16,
    A027_KONNA = 17,
    A028_KOTOKO = 18,
    A031_HAIREI = 19,
    A032_SHINKAN1 = 20,
    A033_MINTSUMA = 21,
    A034_SHINKAN2 = 22,
    A035_SHINKAN3 = 23,
    A036_SHINKAN4 = 24,
    A037_TOUSHU = 25,
    A038_NAWAMIKO = 26,
    A039_DUMMY = 27,
    A040_MAGATOKI = 28,
    A041_DUMMY = 29,
    A042_SYOUKIA = 30,
    A043_SYOUKIB = 31,
    A044_SYOUKIC = 32,
    A051_MKIRIE = 33,
    A058_BOUREI2 = 34,
    A800_BOUREI1 = 35,
    A801_SAKASA = 36,
    A802_KUBI = 37,
    A803_KONNA = 38,
    A804_KOTOKO = 39,
    A001_SAKKA = 40,
    A100_HENSYU = 41,
    A101_HENSYU = 42,
    A102_HENSYU = 43,
    A103_HENREI = 44,
    A104_HENREI = 45,
    A105_HENSYU = 46,
    A106_JYOSYU = 47,
    A107_MEKAKUSHI = 48,
    A108_JYOSYU = 49,
    A109_JYOSYU = 50,
    A110_MINTSUMA = 51,
    A111_KUBI = 52,
    A112_SAKKA = 53,
    A113_KOKIRIE = 54,
    A114_SAKKA = 55,
    A115_SAKKAN = 56,
    A116_MAFUYU = 57,
    A119_JYOSYU = 58,
    A120_KOKIRIE = 59,
    A122_JYOSYU = 60,
    A125_SAKKA = 61,
    A126_SAKASA = 62,
    A128_HENSYU = 63,
    A129_HENREI = 64,
    A130_HENSHITAI = 65,
    A200_MAYOIGO4 = 66,
    A205_MAFUYU = 67,
    A206_MAYOIGO1 = 68,
    A207_MINZOKU = 69,
    A209_KOKIRIE = 70,
    A211_MINZOKU = 71,
    A213_MINZOKU = 72,
    A216_MINZOKU = 73,
    A300_JITOUSHU = 74,
    A301_JITOUSHU = 75,
    A400_KOKIRIE = 76,
    MAN_ANM_ID_MAX = 77
};

enum GHOST_SE_ID {
    SG000_HENREI = 0,
    SG001_JYOREI = 1,
    SG002_SAKKA = 2,
    SG003_DUMMY = 3,
    SG004_MAYOIGO1 = 4,
    SG005_DUMMY = 5,
    SG006_DUMMY = 6,
    SG007_DUMMY = 7,
    SG008_DUMMY = 8,
    SG009_KOMUSO = 9,
    SG010_DUMMY = 10,
    SG011_DUMMY = 11,
    SG012_DUMMY = 12,
    SG013_DUMMY = 13,
    SG014_DUMMY = 14,
    SG015_DUMMY = 15,
    SG016_DUMMY = 16,
    SG017_DUMMY = 17,
    SG018_TENAGA = 18,
    SG019_DUMMY = 19,
    SG020_KAMIONNA = 20,
    SG021_KUBI = 21,
    SG022_DUMMY = 22,
    SG023_DUMMY = 23,
    SG024_DUMMY = 24,
    SG025_DUMMY = 25,
    SG026_DUMMY = 26,
    SE_GHOST_ID_MAX = 27
};

enum {
    CAPN_MAINMENU = 0,
    CAPN_OPTION = 1,
    CAPN_SAVEPOINT = 2,
    CAPN_MODE_SEL = 3,
    CAPN_MISSION_SEL = 4,
    CAPN_SOUND_TEST = 5,
    CAPN_SCR_BRIGHTNESS = 6,
    CAPN_CONTROLLER = 7,
    CAPN_LOAD = 8,
    CAPN_SAVE = 9,
    CAPN_PHOTO_LIST = 10,
    CAPN_PHOTO_ENLARGE = 11,
    CAPN_FILE_LIST = 12,
    CAPN_FILE_DISP = 13,
    CAPN_FILE_PHOTO = 14,
    CAPN_GHOST_LIST = 15,
    CAPN_RANK_LIST = 16,
    CAPN_RANK_ENLARGE = 17,
    CAPN_CAMERA = 18,
    CAPN_ITEM = 19,
    CAPN_ALBUM_ENLARGE = 20,
    CAPN_GET_FILE = 21,
    CAPN_ALBUM = 22
};

enum CD_FILE_DAT {
    DUMMYDUMMY00_OBJ = 0,
    DUMMYDUMMY01_OBJ = 1,
    DUMMYDUMMY02_OBJ = 2,
    DUMMYDUMMY03_OBJ = 3,
    DUMMYDUMMY04_OBJ = 4,
    DUMMYDUMMY05_OBJ = 5,
    DUMMYDUMMY06_OBJ = 6,
    DUMMYDUMMY07_OBJ = 7,
    DUMMYDUMMY08_OBJ = 8,
    DUMMYDUMMY09_OBJ = 9,
    MSN00MAP_OBJ = 10,
    MSN01MAP_OBJ = 11,
    MSN02MAP_OBJ = 12,
    MSN03MAP_OBJ = 13,
    MSN04MAP_OBJ = 14,
    M0_EVENT_OBJ = 15,
    M1_EVENT_OBJ = 16,
    M2_EVENT_OBJ = 17,
    M3_EVENT_OBJ = 18,
    M4_EVENT_OBJ = 19,
    IG_MSG_OBJ = 20,
    ENE_ACT0_OBJ = 21,
    ENE_ACT1_OBJ = 22,
    ENE_ACT2_OBJ = 23,
    ENE_ACT3_OBJ = 24,
    ENE_ACT4_OBJ = 25,
    MAP_CAM1_OBJ = 26,
    MAP_CAM2_OBJ = 27,
    MAP_CAM3_OBJ = 28,
    BMAP_CAM1_OBJ = 29,
    BMAP_CAM2_OBJ = 30,
    BMAP_CAM3_OBJ = 31,
    DMAP_CAM1_OBJ = 32,
    DMAP_CAM2_OBJ = 33,
    DMAP_CAM3_OBJ = 34,
    TMAP_CAM1_OBJ = 35,
    TMAP_CAM2_OBJ = 36,
    TMAP_CAM3_OBJ = 37,
    MSN00TTL_PK2 = 38,
    MSN01TTL_PK2 = 39,
    MSN02TTL_PK2 = 40,
    MSN03TTL_PK2 = 41,
    MSN04TTL_PK2 = 42,
    EVTEX00_PK2 = 43,
    EVTEX00B_PK2 = 44,
    EVTEX00C_PK2 = 45,
    EVTEX00D_PK2 = 46,
    EVTEX00E_PK2 = 47,
    EVTEX00F_PK2 = 48,
    EVTEX00G_PK2 = 49,
    EVTEX01_PK2 = 50,
    EVTEX02A_PK2 = 51,
    EVTEX02B_PK2 = 52,
    EVTEX02C_PK2 = 53,
    EVTEX03_PK2 = 54,
    EVTEX04_PK2 = 55,
    EVTEX20_PK2 = 56,
    EVTEX21_PK2 = 57,
    EVTEX_ZUSI_PK2 = 58,
    TX_PZL_BG_KI_PK2 = 59,
    TX_PZL_BG_DO_PK2 = 60,
    TX_PZL_BG_AI_PK2 = 61,
    TX_PZL_BG_RK_PK2 = 62,
    TX_PZL_MENZ_PK2 = 63,
    TX_BTL_DMY_PK2 = 64,
    M_SLCT_STY_DMY_PK2 = 65,
    TX_BTL_RES_PK2 = 66,
    EFF001_PK2 = 67,
    FNT001_PK2 = 68,
    PHOTO001_PK2 = 69,
    PL_STTS_PK2 = 70,
    PL_SAVE_PK2 = 71,
    PL_PSVP_PK2 = 72,
    PL_GOVR_PK2 = 73,
    PL_FNDR_PK2 = 74,
    PL_LIFE_PK2 = 75,
    PL_BGBG_PK2 = 76,
    PL_PLDT_PK2 = 77,
    PL_MTOP_PK2 = 78,
    PL_SMAP_PK2 = 79,
    PL_ITEM_PK2 = 80,
    PL_PHOT_PK2 = 81,
    PL_FILE_PK2 = 82,
    PL_FILE_REL_PK2 = 83,
    PL_RANK_PK2 = 84,
    PL_OPTI_PK2 = 85,
    PL_ALBM_PK2 = 86,
    PL_ALBM_SW_PK2 = 87,
    PL_ALBM_SP_PK2 = 88,
    PL_ALBM_SR_PK2 = 89,
    PL_ALBM_SG_PK2 = 90,
    PL_ALBM_SB_PK2 = 91,
    PL_ALBM_SO_PK2 = 92,
    PL_ALBM_BW_PK2 = 93,
    PL_ALBM_BP_PK2 = 94,
    PL_ALBM_BR_PK2 = 95,
    PL_ALBM_BG_PK2 = 96,
    PL_ALBM_BB_PK2 = 97,
    PL_ALBM_BO_PK2 = 98,
    PL_ALBM_SAVE_PK2 = 99,
    PL_ALBM_FSM_PK2 = 100,
    PL_GLST_PK2 = 101,
    PL_CAME_PK2 = 102,
    PL_PLAY_PK2 = 103,
    SV_PHT_PK2 = 104,
    S_MODE_CLEARBG_PK2 = 105,
    STG00TTL_PK2 = 106,
    STG01TTL_PK2 = 107,
    STG02TTL_PK2 = 108,
    STG03TTL_PK2 = 109,
    STG04TTL_PK2 = 110,
    STG05TTL_PK2 = 111,
    STG06TTL_PK2 = 112,
    STG07TTL_PK2 = 113,
    STG08TTL_PK2 = 114,
    STG09TTL_PK2 = 115,
    STG10TTL_PK2 = 116,
    STG11TTL_PK2 = 117,
    STG12TTL_PK2 = 118,
    STG13TTL_PK2 = 119,
    STG14TTL_PK2 = 120,
    STG15TTL_PK2 = 121,
    STG16TTL_PK2 = 122,
    STG17TTL_PK2 = 123,
    STG18TTL_PK2 = 124,
    STG19TTL_PK2 = 125,
    STG20TTL_PK2 = 126,
    STG21TTL_PK2 = 127,
    STG22TTL_PK2 = 128,
    STG23TTL_PK2 = 129,
    STG24TTL_PK2 = 130,
    STG25TTL_PK2 = 131,
    STG26TTL_PK2 = 132,
    STG27TTL_PK2 = 133,
    STG28TTL_PK2 = 134,
    STG29TTL_PK2 = 135,
    ITEM_00_TM2 = 136,
    ITEM_01_TM2 = 137,
    ITEM_02_TM2 = 138,
    ITEM_03_TM2 = 139,
    ITEM_04_TM2 = 140,
    ITEM_05_TM2 = 141,
    ITEM_06_TM2 = 142,
    ITEM_07_TM2 = 143,
    ITEM_08_TM2 = 144,
    ITEM_09_TM2 = 145,
    ITEM_10_TM2 = 146,
    ITEM_11_TM2 = 147,
    ITEM_12_TM2 = 148,
    ITEM_13_TM2 = 149,
    ITEM_14_TM2 = 150,
    ITEM_15_TM2 = 151,
    ITEM_16_TM2 = 152,
    ITEM_17_TM2 = 153,
    ITEM_18_TM2 = 154,
    ITEM_19_TM2 = 155,
    ITEM_20_TM2 = 156,
    ITEM_21_TM2 = 157,
    ITEM_22_TM2 = 158,
    ITEM_23_TM2 = 159,
    ITEM_24_TM2 = 160,
    ITEM_25_TM2 = 161,
    ITEM_26_TM2 = 162,
    ITEM_27_TM2 = 163,
    ITEM_28_TM2 = 164,
    ITEM_29_TM2 = 165,
    ITEM_30_TM2 = 166,
    ITEM_31_TM2 = 167,
    ITEM_32_TM2 = 168,
    ITEM_33_TM2 = 169,
    ITEM_34_TM2 = 170,
    ITEM_35_TM2 = 171,
    ITEM_36_TM2 = 172,
    ITEM_37_TM2 = 173,
    ITEM_38_TM2 = 174,
    ITEM_39_TM2 = 175,
    ITEM_40_TM2 = 176,
    ITEM_41_TM2 = 177,
    ITEM_42_TM2 = 178,
    ITEM_43_TM2 = 179,
    ITEM_44_TM2 = 180,
    ITEM_45_TM2 = 181,
    ITEM_46_TM2 = 182,
    ITEM_47_TM2 = 183,
    ITEM_48_TM2 = 184,
    ITEM_49_TM2 = 185,
    ITEM_50_TM2 = 186,
    ITEM_51_TM2 = 187,
    ITEM_52_TM2 = 188,
    ITEM_53_TM2 = 189,
    ITEM_54_TM2 = 190,
    ITEM_55_TM2 = 191,
    ITEM_56_TM2 = 192,
    ITEM_57_TM2 = 193,
    ITEM_58_TM2 = 194,
    ITEM_59_TM2 = 195,
    ITEM_60_TM2 = 196,
    ITEM_61_TM2 = 197,
    ITEM_62_TM2 = 198,
    ITEM_63_TM2 = 199,
    ITEM_64_TM2 = 200,
    ITEM_65_TM2 = 201,
    ITEM_66_TM2 = 202,
    ITEM_67_TM2 = 203,
    ITEM_68_TM2 = 204,
    ITEM_69_TM2 = 205,
    ITEM_70_TM2 = 206,
    HINT_00_TM2 = 207,
    HINT_01_TM2 = 208,
    HINT_02_TM2 = 209,
    HINT_03_TM2 = 210,
    HINT_04_TM2 = 211,
    HINT_05_TM2 = 212,
    HINT_06_TM2 = 213,
    HINT_07_TM2 = 214,
    HINT_08_TM2 = 215,
    HINT_09_TM2 = 216,
    HINT_10_TM2 = 217,
    HINT_11_TM2 = 218,
    HINT_12_TM2 = 219,
    HINT_13_TM2 = 220,
    HINT_14_TM2 = 221,
    HINT_15_TM2 = 222,
    HINT_16_TM2 = 223,
    HINT_17_TM2 = 224,
    HINT_18_TM2 = 225,
    HINT_19_TM2 = 226,
    HINT_20_TM2 = 227,
    HINT_21_TM2 = 228,
    HINT_22_TM2 = 229,
    HINT_23_TM2 = 230,
    HINT_24_TM2 = 231,
    HINT_25_TM2 = 232,
    HINT_26_TM2 = 233,
    HINT_27_TM2 = 234,
    HINT_28_TM2 = 235,
    HINT_29_TM2 = 236,
    HINT_30_TM2 = 237,
    HINT_31_TM2 = 238,
    HINT_32_TM2 = 239,
    HINT_33_TM2 = 240,
    HINT_34_TM2 = 241,
    HINT_35_TM2 = 242,
    HINT_36_TM2 = 243,
    HINT_37_TM2 = 244,
    HINT_38_TM2 = 245,
    HINT_39_TM2 = 246,
    HINT_40_TM2 = 247,
    HINT_41_TM2 = 248,
    HINT_42_TM2 = 249,
    HINT_43_TM2 = 250,
    HINT_44_TM2 = 251,
    HINT_45_TM2 = 252,
    HINT_46_TM2 = 253,
    HINT_47_TM2 = 254,
    IPHT_00_TM2 = 255,
    IPHT_01_TM2 = 256,
    IPHT_02_TM2 = 257,
    IPHT_03_TM2 = 258,
    TITLE_PK2 = 259,
    M_SLCT_BTL_PK2 = 260,
    M_SLCT_BTL_CHR_PK2 = 261,
    M_SLCT_BTL_MSN_PK2 = 262,
    M_SLCT_CMN_PK2 = 263,
    M_SLCT_FSM_PK2 = 264,
    M_SLCT_OPT_PK2 = 265,
    M_SLCT_SND_PK2 = 266,
    M_SLCT_STY_PK2 = 267,
    PHT_SCR_PK2 = 268,
    TEST2D_PK2 = 269,
    ICON_OBJ = 270,
    ICON2_OBJ = 271,
    RARE_ENE001_PK2 = 272,
    PAZ_ENE001_PK2 = 273,
    PAZ_ENE002_PK2 = 274,
    PAZ_ENE003_PK2 = 275,
    PAZ_ENE004_PK2 = 276,
    PAZ_ENE005_PK2 = 277,
    PAZ_ENE006_PK2 = 278,
    PAZ_ENE007_PK2 = 279,
    HINT_00_PK2 = 280,
    HINT_01_PK2 = 281,
    HINT_02_PK2 = 282,
    HINT_03_PK2 = 283,
    HINT_04_PK2 = 284,
    HINT_05_PK2 = 285,
    HINT_06_PK2 = 286,
    HINT_07_PK2 = 287,
    HINT_08_PK2 = 288,
    HINT_09_PK2 = 289,
    HINT_10_PK2 = 290,
    HINT_11_PK2 = 291,
    HINT_12_PK2 = 292,
    HINT_13_PK2 = 293,
    HINT_14_PK2 = 294,
    HINT_15_PK2 = 295,
    HINT_16_PK2 = 296,
    HINT_17_PK2 = 297,
    HINT_18_PK2 = 298,
    HINT_19_PK2 = 299,
    HINT_20_PK2 = 300,
    HINT_21_PK2 = 301,
    HINT_22_PK2 = 302,
    HINT_23_PK2 = 303,
    HINT_24_PK2 = 304,
    HINT_25_PK2 = 305,
    HINT_26_PK2 = 306,
    HINT_27_PK2 = 307,
    HINT_28_PK2 = 308,
    HINT_29_PK2 = 309,
    HINT_30_PK2 = 310,
    HINT_31_PK2 = 311,
    HINT_32_PK2 = 312,
    HINT_33_PK2 = 313,
    HINT_34_PK2 = 314,
    HINT_35_PK2 = 315,
    HINT_36_PK2 = 316,
    HINT_37_PK2 = 317,
    HINT_38_PK2 = 318,
    HINT_39_PK2 = 319,
    HINT_40_PK2 = 320,
    HINT_41_PK2 = 321,
    HINT_42_PK2 = 322,
    HINT_43_PK2 = 323,
    HINT_44_PK2 = 324,
    HINT_45_PK2 = 325,
    HINT_46_PK2 = 326,
    HINT_47_PK2 = 327,
    REA_00_PK2 = 328,
    REA_01_PK2 = 329,
    REA_02_PK2 = 330,
    REA_03_PK2 = 331,
    REA_04_PK2 = 332,
    REA_05_PK2 = 333,
    REA_06_PK2 = 334,
    REA_07_PK2 = 335,
    REA_08_PK2 = 336,
    REA_09_PK2 = 337,
    REA_10_PK2 = 338,
    REA_11_PK2 = 339,
    REA_12_PK2 = 340,
    REA_13_PK2 = 341,
    REA_14_PK2 = 342,
    REA_15_PK2 = 343,
    REA_16_PK2 = 344,
    REA_17_PK2 = 345,
    REA_18_PK2 = 346,
    REA_19_PK2 = 347,
    REA_20_PK2 = 348,
    REA_21_PK2 = 349,
    REA_22_PK2 = 350,
    REA_23_PK2 = 351,
    REA_24_PK2 = 352,
    ENEDMG_PK2 = 353,
    ENEFACE001_PK2 = 354,
    ENEFACE002_PK2 = 355,
    ENEFACE003_PK2 = 356,
    ENEFACE004_PK2 = 357,
    ENEFACE005_PK2 = 358,
    M010_E_PK2 = 359,
    M011_E_PK2 = 360,
    M012_E_PK2 = 361,
    M013_E_PK2 = 362,
    M014_E_PK2 = 363,
    M015_E_PK2 = 364,
    M016_E_PK2 = 365,
    M018_E_PK2 = 366,
    M019_E_PK2 = 367,
    M020_E_PK2 = 368,
    M021_E_PK2 = 369,
    M022_E_PK2 = 370,
    M023_E_PK2 = 371,
    M024_E_PK2 = 372,
    M025_E_PK2 = 373,
    M027_E_PK2 = 374,
    M028_E_PK2 = 375,
    M031_E_PK2 = 376,
    M032_E_PK2 = 377,
    M033_E_PK2 = 378,
    M034_E_PK2 = 379,
    M035_E_PK2 = 380,
    M036_E_PK2 = 381,
    M037_E_PK2 = 382,
    M038_E_PK2 = 383,
    M040_E_PK2 = 384,
    M042_E_PK2 = 385,
    G_OVER_PK2 = 386,
    N_LOAD_PK2 = 387,
    LOGO_PK2 = 388,
    HAND_PK2 = 389,
    M000_DMY_TM2 = 390,
    M001_LIST_TM2 = 391,
    M002_LIST_TM2 = 392,
    M003_LIST_TM2 = 393,
    M004_LIST_TM2 = 394,
    M005_LIST_TM2 = 395,
    M006_LIST_TM2 = 396,
    M007_DMY_TM2 = 397,
    M008_DMY_TM2 = 398,
    M009_DMY_TM2 = 399,
    M010_LIST_TM2 = 400,
    M011_LIST_TM2 = 401,
    M012_LIST_TM2 = 402,
    M013_LIST_TM2 = 403,
    M014_LIST_TM2 = 404,
    M015_LIST_TM2 = 405,
    M016_LIST_TM2 = 406,
    M017_DMY_TM2 = 407,
    M018_LIST_TM2 = 408,
    M019_LIST_TM2 = 409,
    M020_LIST_TM2 = 410,
    M021_LIST_TM2 = 411,
    M022_LIST_TM2 = 412,
    M023_LIST_TM2 = 413,
    M024_LIST_TM2 = 414,
    M025_LIST_TM2 = 415,
    M026_LIST_TM2 = 416,
    M027_LIST_TM2 = 417,
    M028_LIST_TM2 = 418,
    M029_LIST_TM2 = 419,
    M030_DMY_TM2 = 420,
    M031_LIST_TM2 = 421,
    M032_LIST_TM2 = 422,
    M033_LIST_TM2 = 423,
    M034_LIST_TM2 = 424,
    M035_LIST_TM2 = 425,
    M036_LIST_TM2 = 426,
    M037_LIST_TM2 = 427,
    M038_LIST_TM2 = 428,
    M039_DMY_TM2 = 429,
    M040_LIST_TM2 = 430,
    M041_DMY_TM2 = 431,
    M042_LIST_TM2 = 432,
    M043_LIST_TM2 = 433,
    M044_LIST_TM2 = 434,
    M045_DMY_TM2 = 435,
    M046_DMY_TM2 = 436,
    M047_DMY_TM2 = 437,
    M048_DMY_TM2 = 438,
    M049_DMY_TM2 = 439,
    M050_DMY_TM2 = 440,
    M051_LIST_TM2 = 441,
    M052_DMY_TM2 = 442,
    M053_DMY_TM2 = 443,
    M054_DMY_TM2 = 444,
    M055_DMY_TM2 = 445,
    M056_DMY_TM2 = 446,
    M057_DMY_TM2 = 447,
    M058_LIST_TM2 = 448,
    M059_DMY_TM2 = 449,
    M060_DMY_TM2 = 450,
    M061_LIST_TM2 = 451,
    A00_LIST_TM2 = 452,
    A01_LIST_TM2 = 453,
    A02_LIST_TM2 = 454,
    A03_LIST_TM2 = 455,
    A04_LIST_TM2 = 456,
    A05_LIST_TM2 = 457,
    A06_LIST_TM2 = 458,
    A07_LIST_TM2 = 459,
    A08_LIST_TM2 = 460,
    A09_LIST_TM2 = 461,
    A10_LIST_TM2 = 462,
    A11_LIST_TM2 = 463,
    A12_LIST_TM2 = 464,
    A13_LIST_TM2 = 465,
    A14_LIST_TM2 = 466,
    A15_LIST_TM2 = 467,
    A16_LIST_TM2 = 468,
    A17_LIST_TM2 = 469,
    A18_LIST_TM2 = 470,
    A19_LIST_TM2 = 471,
    A20_LIST_TM2 = 472,
    A21_LIST_TM2 = 473,
    A22_LIST_TM2 = 474,
    A23_LIST_TM2 = 475,
    A24_LIST_TM2 = 476,
    A25_LIST_TM2 = 477,
    A26_LIST_TM2 = 478,
    A27_LIST_TM2 = 479,
    A28_LIST_TM2 = 480,
    A29_LIST_TM2 = 481,
    A30_LIST_TM2 = 482,
    A31_LIST_TM2 = 483,
    A32_LIST_TM2 = 484,
    A33_LIST_TM2 = 485,
    A34_LIST_TM2 = 486,
    A35_LIST_TM2 = 487,
    A36_LIST_TM2 = 488,
    A37_LIST_TM2 = 489,
    A38_LIST_TM2 = 490,
    A39_LIST_TM2 = 491,
    A40_LIST_TM2 = 492,
    A41_LIST_TM2 = 493,
    A42_LIST_TM2 = 494,
    A43_LIST_TM2 = 495,
    A44_LIST_TM2 = 496,
    A45_LIST_TM2 = 497,
    A46_LIST_TM2 = 498,
    REA00_LIST_TM2 = 499,
    REA01_LIST_TM2 = 500,
    REA02_LIST_TM2 = 501,
    REA03_LIST_TM2 = 502,
    REA04_LIST_TM2 = 503,
    REA05_LIST_TM2 = 504,
    REA06_LIST_TM2 = 505,
    REA07_LIST_TM2 = 506,
    REA08_LIST_TM2 = 507,
    REA09_LIST_TM2 = 508,
    REA10_LIST_TM2 = 509,
    REA11_LIST_TM2 = 510,
    REA12_LIST_TM2 = 511,
    REA13_LIST_TM2 = 512,
    REA14_LIST_TM2 = 513,
    REA15_LIST_TM2 = 514,
    REA16_LIST_TM2 = 515,
    REA17_LIST_TM2 = 516,
    REA18_LIST_TM2 = 517,
    REA19_LIST_TM2 = 518,
    REA20_LIST_TM2 = 519,
    REA21_LIST_TM2 = 520,
    REA22_LIST_TM2 = 521,
    REA23_LIST_TM2 = 522,
    REA24_LIST_TM2 = 523,
    PZL_NAME00_TM2 = 524,
    PZL_NAME01_TM2 = 525,
    PZL_NAME02_TM2 = 526,
    PZL_NAME03_TM2 = 527,
    PZL_NAME04_TM2 = 528,
    PZL_NAME05_TM2 = 529,
    PZL_NAME06_TM2 = 530,
    REL00_SAKKA_TM2 = 531,
    REL01_JYOSYU_TM2 = 532,
    REL02_HENSYU_TM2 = 533,
    REL03_TOUSHU_TM2 = 534,
    REL04_KIRIE_TM2 = 535,
    REL05_SHINKAN_TM2 = 536,
    REL06_KOKIRIE_TM2 = 537,
    REL07_MINZOKU_TM2 = 538,
    REL08_MINTUM_TM2 = 539,
    REL09_MINMUS_TM2 = 540,
    REL10_MAFUYU_TM2 = 541,
    REL11_MIKU_TM2 = 542,
    REL12_MIYUKI_TM2 = 543,
    SCENE0010_MOVIE_SCN = 544,
    SCENE0010_MOVIE_SLT = 545,
    SCENE0020_SCN = 546,
    SCENE0020_SLT = 547,
    SCENE0022_SCN = 548,
    SCENE0022_SLT = 549,
    SCENE0030_SCN = 550,
    SCENE0030_SLT = 551,
    SCENE0031_MOVIE_SCN = 552,
    SCENE0031_MOVIE_SLT = 553,
    SCENE1000_MOVIE_SCN = 554,
    SCENE1000_MOVIE_SLT = 555,
    SCENE1010_SCN = 556,
    SCENE1010_SLT = 557,
    SCENE1030_SCN = 558,
    SCENE1030_SLT = 559,
    SCENE1031_MOVIE_SCN = 560,
    SCENE1031_MOVIE_SLT = 561,
    SCENE1034_SCN = 562,
    SCENE1034_SLT = 563,
    SCENE1070_SCN = 564,
    SCENE1070_SLT = 565,
    SCENE1080_SCN = 566,
    SCENE1080_SLT = 567,
    SCENE1090_SCN = 568,
    SCENE1090_SLT = 569,
    SCENE1100_SCN = 570,
    SCENE1100_SLT = 571,
    SCENE1101_MOVIE_SCN = 572,
    SCENE1101_MOVIE_SLT = 573,
    SCENE1102_SCN = 574,
    SCENE1102_SLT = 575,
    SCENE1120_SCN = 576,
    SCENE1120_SLT = 577,
    SCENE1150_SCN = 578,
    SCENE1150_SLT = 579,
    SCENE1160_SCN = 580,
    SCENE1160_SLT = 581,
    SCENE1170_SCN = 582,
    SCENE1170_SLT = 583,
    SCENE1180_SCN = 584,
    SCENE1180_SLT = 585,
    SCENE1220_SCN = 586,
    SCENE1220_SLT = 587,
    SCENE1230_SCN = 588,
    SCENE1230_SLT = 589,
    SCENE1240_MOVIE_SCN = 590,
    SCENE1240_MOVIE_SLT = 591,
    SCENE1250_SCN = 592,
    SCENE1250_SLT = 593,
    SCENE1260_SCN = 594,
    SCENE1260_SLT = 595,
    SCENE1280_SCN = 596,
    SCENE1280_SLT = 597,
    SCENE1300_MOVIE_SCN = 598,
    SCENE1300_MOVIE_SLT = 599,
    SCENE1301_SCN = 600,
    SCENE1301_SLT = 601,
    SCENE1320_SCN = 602,
    SCENE1320_SLT = 603,
    SCENE1330_SCN = 604,
    SCENE1330_SLT = 605,
    SCENE1331_MOVIE_SCN = 606,
    SCENE1331_MOVIE_SLT = 607,
    SCENE1332_MOVIE_SCN = 608,
    SCENE1332_MOVIE_SLT = 609,
    SCENE1340_SCN = 610,
    SCENE1340_SLT = 611,
    SCENE1410_SCN = 612,
    SCENE1410_SLT = 613,
    SCENE2010_MOVIE_SCN = 614,
    SCENE2010_MOVIE_SLT = 615,
    SCENE2013_SCN = 616,
    SCENE2013_SLT = 617,
    SCENE2020_SCN = 618,
    SCENE2020_SLT = 619,
    SCENE2030_SCN = 620,
    SCENE2030_SLT = 621,
    SCENE2040_SCN = 622,
    SCENE2040_SLT = 623,
    SCENE2050_MOVIE_SCN = 624,
    SCENE2050_MOVIE_SLT = 625,
    SCENE2060_SCN = 626,
    SCENE2060_SLT = 627,
    SCENE2061_MOVIE_SCN = 628,
    SCENE2061_MOVIE_SLT = 629,
    SCENE2062_SCN = 630,
    SCENE2062_SLT = 631,
    SCENE2070_SCN = 632,
    SCENE2070_SLT = 633,
    SCENE2071_MOVIE_SCN = 634,
    SCENE2071_MOVIE_SLT = 635,
    SCENE2072_SCN = 636,
    SCENE2072_SLT = 637,
    SCENE2090_SCN = 638,
    SCENE2090_SLT = 639,
    SCENE2091_MOVIE_SCN = 640,
    SCENE2091_MOVIE_SLT = 641,
    SCENE2092_SCN = 642,
    SCENE2092_SLT = 643,
    SCENE2100_SCN = 644,
    SCENE2100_SLT = 645,
    SCENE2110_MOVIE_SCN = 646,
    SCENE2110_MOVIE_SLT = 647,
    SCENE2130_SCN = 648,
    SCENE2130_SLT = 649,
    SCENE2131_MOVIE_SCN = 650,
    SCENE2131_MOVIE_SLT = 651,
    SCENE2132_SCN = 652,
    SCENE2132_SLT = 653,
    SCENE2140_SCN = 654,
    SCENE2140_SLT = 655,
    SCENE2141_SCN = 656,
    SCENE2141_SLT = 657,
    SCENE2142_MOVIE_SCN = 658,
    SCENE2142_MOVIE_SLT = 659,
    SCENE2143_MOVIE_SCN = 660,
    SCENE2143_MOVIE_SLT = 661,
    SCENE2150_SCN = 662,
    SCENE2150_SLT = 663,
    SCENE2160_SCN = 664,
    SCENE2160_SLT = 665,
    SCENE2170_SCN = 666,
    SCENE2170_SLT = 667,
    SCENE2171_MOVIE_SCN = 668,
    SCENE2171_MOVIE_SLT = 669,
    SCENE3010_MOVIE_SCN = 670,
    SCENE3010_MOVIE_SLT = 671,
    SCENE3020_SCN = 672,
    SCENE3020_SLT = 673,
    SCENE3030_SCN = 674,
    SCENE3030_SLT = 675,
    SCENE3040_MOVIE_SCN = 676,
    SCENE3040_MOVIE_SLT = 677,
    SCENE3050_SCN = 678,
    SCENE3050_SLT = 679,
    SCENE3060_SCN = 680,
    SCENE3060_SLT = 681,
    SCENE3070_SCN = 682,
    SCENE3070_SLT = 683,
    SCENE3080_MOVIE_SCN = 684,
    SCENE3080_MOVIE_SLT = 685,
    SCENE3081_MOVIE_SCN = 686,
    SCENE3081_MOVIE_SLT = 687,
    SCENE3090_MOVIE_SCN = 688,
    SCENE3090_MOVIE_SLT = 689,
    SCENE3100_SCN = 690,
    SCENE3100_SLT = 691,
    SCENE3110_SCN = 692,
    SCENE3110_SLT = 693,
    SCENE4010_MOVIE_SCN = 694,
    SCENE4010_MOVIE_SLT = 695,
    SCENE4011_SCN = 696,
    SCENE4011_SLT = 697,
    SCENE4020_SCN = 698,
    SCENE4020_SLT = 699,
    SCENE4030_SCN = 700,
    SCENE4030_SLT = 701,
    SCENE4031_MOVIE_SCN = 702,
    SCENE4031_MOVIE_SLT = 703,
    SCENE4040_SCN = 704,
    SCENE4040_SLT = 705,
    SCENE4041_MOVIE_SCN = 706,
    SCENE4041_MOVIE_SLT = 707,
    SCENE4042_SCN = 708,
    SCENE4042_SLT = 709,
    SCENE4050_SCN = 710,
    SCENE4050_SLT = 711,
    SCENE4060_MOVIE_SCN = 712,
    SCENE4060_MOVIE_SLT = 713,
    SCENE4070_SCN = 714,
    SCENE4070_SLT = 715,
    SCENE4080_MOVIE_SCN = 716,
    SCENE4080_MOVIE_SLT = 717,
    SCENE4090_MOVIE_SCN = 718,
    SCENE4090_MOVIE_SLT = 719,
    SCENE4100_MOVIE_SCN = 720,
    SCENE4100_MOVIE_SLT = 721,
    SCENE4110_MOVIE_SCN = 722,
    SCENE4110_MOVIE_SLT = 723,
    SCENE4120_MOVIE_SCN = 724,
    SCENE4120_MOVIE_SLT = 725,
    SCENE5010_MOVIE_SCN = 726,
    SCENE5010_MOVIE_SLT = 727,
    SCENE5020_MOVIE_SCN = 728,
    SCENE5020_MOVIE_SLT = 729,
    SCENE4900_SCN = 730,
    SCENE4900_SLT = 731,
    SCENE4901_SCN = 732,
    SCENE4901_SLT = 733,
    SCENE9000_MOVIE_SCN = 734,
    SCENE9000_MOVIE_SLT = 735,
    SCENE9001_MOVIE_SCN = 736,
    SCENE9001_MOVIE_SLT = 737,
    R000_GENKAN_MIM = 738,
    R001_MIM = 739,
    R002_MIM = 740,
    R003_OUSETSU_MIM = 741,
    R004_MIM = 742,
    R005_MIM = 743,
    R006_MIM = 744,
    R007_TOMURAI_MIM = 745,
    R008_MIM = 746,
    R009_NANDO_MIM = 747,
    R010_MIM = 748,
    R011_GOIMON_MIM = 749,
    R012_MIM = 750,
    R013_MIM = 751,
    R014_MIM = 752,
    R015_MIM = 753,
    R016_MIM = 754,
    R017_MIM = 755,
    R018_MIM = 756,
    R019_MIM = 757,
    R020_MIM = 758,
    R021_URANIWA_MIM = 759,
    R022_MIM = 760,
    R023_MIM = 761,
    R024_MIM = 762,
    R025_MIM = 763,
    R026_MIM = 764,
    R027_MIM = 765,
    R028_MIM = 766,
    R029_MIM = 767,
    R030_MIM = 768,
    R031_MIM = 769,
    R032_MIM = 770,
    R033_MIM = 771,
    R034_MIM = 772,
    R035_MIM = 773,
    R036_MIM = 774,
    R037_MIM = 775,
    R038_TYOUBOU_MIM = 776,
    R039_MIM = 777,
    R040_MIM = 778,
    R041_HIKAE_MIM = 779,
    M000_MIKU_BWC = 780,
    M000_MIKU_CLT = 781,
    M000_SPE1_BWC = 782,
    M000_SPE1_CLT = 783,
    M000_SPE2_BWC = 784,
    M000_SPE2_CLT = 785,
    M000_SPE3_BWC = 786,
    M000_SPE3_CLT = 787,
    M001_MAFUYU_BWC = 788,
    M001_MAFUYU_CLT = 789,
    M000_MIKU_ACS = 790,
    M000_MIKU_PK2 = 791,
    M000_MIKU_MPK = 792,
    M000_SPE1_PK2 = 793,
    M000_SPE2_PK2 = 794,
    M000_SPE3_PK2 = 795,
    M001_MAFUYU_ACS = 796,
    M001_MAFUYU_PK2 = 797,
    M001_MAFUYU_MPK = 798,
    M000_MIKU_MDL = 799,
    M001_MAFUYU_MDL = 800,
    M002_MONOSAK_MDL = 801,
    M003_HENSYU_MDL = 802,
    M004_JYOSYU_MDL = 803,
    M005_SAKKA_MDL = 804,
    M006_KOKIRIE_MDL = 805,
    M007_KAZOKU_MDL = 806,
    M008_DUMMY_MDL = 807,
    M009_HENSHITAI_MDL = 808,
    M010_HENREI_MDL = 809,
    M011_JYOREI_MDL = 810,
    M012_SAKKAREI_MDL = 811,
    M013_TENAGA_MDL = 812,
    M014_KAMIONNA_MDL = 813,
    M015_KOMUSO_MDL = 814,
    M016_MINREI_MDL = 815,
    M017_KIRIE_MDL = 816,
    M018_MAYOIGO1_MDL = 817,
    M019_BOUREI1_MDL = 818,
    M020_SAKASA_MDL = 819,
    M021_KUBI_MDL = 820,
    M022_MAYOIGO2_MDL = 821,
    M023_MAYOIGO3_MDL = 822,
    M024_MEKAKUSHI_MDL = 823,
    M025_RTE_MDL = 824,
    M026_MINZOKU_MDL = 825,
    M027_KONNA_MDL = 826,
    M028_KOTOKO_MDL = 827,
    M029_MAYOIGO4_MDL = 828,
    M030_SAKKAGE_MDL = 829,
    M031_HAIREI_MDL = 830,
    M032_SHINKAN1_MDL = 831,
    M033_MINTSUMA_MDL = 832,
    M034_SHINKAN2_MDL = 833,
    M035_SHINKAN3_MDL = 834,
    M036_SHINKAN4_MDL = 835,
    M037_TOUSHU_MDL = 836,
    M038_NAWAMIKO_MDL = 837,
    M039_MAGONLY_MDL = 838,
    M040_MAGATOKI_MDL = 839,
    M041_DUMMY_MDL = 840,
    M042_SYOUKI2_MDL = 841,
    M043_SYOUKI3_MDL = 842,
    M044_SYOUKI4_MDL = 843,
    M045_DUMMY_MDL = 844,
    M046_DUMMY_MDL = 845,
    M047_SAKKAN_MDL = 846,
    M048_DUMMY_MDL = 847,
    M049_HENSYUHAND_MDL = 848,
    M050_LTE_MDL = 849,
    M051_MKIRIE_MDL = 850,
    M052_DUMMY_MDL = 851,
    M053_DUMMY_MDL = 852,
    M054_DUMMY_MDL = 853,
    M055_SYOUALL_MDL = 854,
    M056_MINDEAD_MDL = 855,
    M057_NAWAKOKI_MDL = 856,
    M058_BOUREI2_MDL = 857,
    M059_JITOUSHU_MDL = 858,
    M060_TENAKAGE_MDL = 859,
    M061_MONOJYO_MDL = 860,
    M800_BOUREI1_MDL = 861,
    M801_SAKASA_MDL = 862,
    M802_KUBI_MDL = 863,
    M803_KONNA_MDL = 864,
    M804_KOTOKO_MDL = 865,
    M900_ONNRYOU_MPK = 866,
    M000_MIKU_ANM = 867,
    M001_MAFUYU_ANM = 868,
    M010_HENREI_ANM = 869,
    M011_JYOREI_ANM = 870,
    M012_SAKKAREI_ANM = 871,
    M013_TENAGA_ANM = 872,
    M014_KAMIONNA_ANM = 873,
    M015_KOMUSO_ANM = 874,
    M016_MINREI_ANM = 875,
    M018_MAYOIGO1_ANM = 876,
    M019_BOUREI1_ANM = 877,
    M020_SAKASA_ANM = 878,
    M021_KUBI_ANM = 879,
    M022_MAYOIGO2_ANM = 880,
    M023_MAYOIGO3_ANM = 881,
    M024_MEKAKUSHI_ANM = 882,
    M025_RTE_ANM = 883,
    M027_KONNA_ANM = 884,
    M028_KOTOKO_ANM = 885,
    M031_HAIREI_ANM = 886,
    M032_SHINKAN1_ANM = 887,
    M033_MINTSUMA_ANM = 888,
    M034_SHINKAN2_ANM = 889,
    M035_SHINKAN3_ANM = 890,
    M036_SHINKAN4_ANM = 891,
    M037_TOUSHU_ANM = 892,
    M038_NAWAMIKO_ANM = 893,
    M039_DUMMY_ANM = 894,
    M040_MAGATOKI_ANM = 895,
    M041_DUMMY_ANM = 896,
    M042_SYOUKI2_ANM = 897,
    M043_SYOUKI3_ANM = 898,
    M044_SYOUKI4_ANM = 899,
    M051_MKIRIE_ANM = 900,
    M058_BOUREI2_ANM = 901,
    M800_BOUREI1_ANM = 902,
    M801_SAKASA_ANM = 903,
    M802_KUBI_ANM = 904,
    M803_KONNA_ANM = 905,
    M804_KOTOKO_ANM = 906,
    M005_SAKKA_F001_ANM = 907,
    M003_HENSYU_F100_ANM = 908,
    M003_HENSYU_F101_ANM = 909,
    M003_HENSYU_F102_ANM = 910,
    M010_HENREI_F103_ANM = 911,
    M010_HENREI_F104_ANM = 912,
    M003_HENSYU_F105_ANM = 913,
    M004_JYOSYU_F106_ANM = 914,
    M024_MEKAKUSHI_F107_ANM = 915,
    M004_JYOSYU_F108_ANM = 916,
    M004_JYOSYU_F109_ANM = 917,
    M033_MINTSUMA_F110_ANM = 918,
    M021_KUBI_F111_ANM = 919,
    M005_SAKKA_F112_ANM = 920,
    M006_KOKIRIE_F113_ANM = 921,
    M005_SAKKA_F114_ANM = 922,
    M047_SAKKAN_F115_ANM = 923,
    M001_MAFUYU_F116_ANM = 924,
    M004_JYOSYU_F119_ANM = 925,
    M006_KOKIRIE_F120_ANM = 926,
    M004_JYOSYU_F122_ANM = 927,
    M005_SAKKA_F125_ANM = 928,
    M020_SAKASA_F126_ANM = 929,
    M003_HENSYU_F128_ANM = 930,
    M010_HENREI_F129_ANM = 931,
    M009_HENSHITAI_F130_ANM = 932,
    M029_MAYOIGO4_F200_ANM = 933,
    M001_MAFUYU_F205_ANM = 934,
    M018_MAYOIGO1_F206_ANM = 935,
    M026_MINZOKU_F207_ANM = 936,
    M006_KOKIRIE_F209_ANM = 937,
    M026_MINZOKU_F211_ANM = 938,
    M026_MINZOKU_F213_ANM = 939,
    M026_MINZOKU_F216_ANM = 940,
    M059_JITOUSHU_F300_ANM = 941,
    M059_JITOUSHU_F301_ANM = 942,
    M006_KOKIRIE_F400_ANM = 943,
    I000_PLAY_CAMERA1_SGD = 944,
    I001_PLAY_LIGHT_SGD = 945,
    I002_LIGHTER_SGD = 946,
    I003_CAMERA1_SGD = 947,
    I004_RECORDER_SGD = 948,
    I005_NOTE_SGD = 949,
    I006_KEY_SABI_SGD = 950,
    I007_KEY_EARTH_SGD = 951,
    I008_TAPE2_SGD = 952,
    I009_HIBUTU5_SGD = 953,
    I010_GOSINKYO1_SGD = 954,
    I011_PHOTO_IKKO_SGD = 955,
    I012_DMY = 956,
    I013_GOSINKYO2_SGD = 957,
    I014_DMY = 958,
    I015_DMY = 959,
    I016_KOMON_SGD = 960,
    I017_ISI_GLAY_SGD = 961,
    I018_ISI_BLUE_SGD = 962,
    I019_ISI_YELLOW_SGD = 963,
    I020_ISI_PURPLE_SGD = 964,
    I021_ISI_GREEN_SGD = 965,
    I022_DMY = 966,
    I023_ALBUM_SGD = 967,
    I024_SYOUKI1_SGD = 968,
    I025_SYOUKI2_SGD = 969,
    I026_SYOUKI3_SGD = 970,
    I027_SYOUKI4_SGD = 971,
    I028_SYOUKI5_SGD = 972,
    I029_SYOUKI6_SGD = 973,
    I030_SYOUKI7_SGD = 974,
    I031_SYOUKI8_SGD = 975,
    I032_KIRIE_SGD = 976,
    I033_DMY = 977,
    I034_DMY = 978,
    I035_KENKYU_SGD = 979,
    I036_PHOTO_NAWA_SGD = 980,
    I037_DMY = 981,
    I038_HIKIDO_SGD = 982,
    I039_DMY = 983,
    I040_DMY = 984,
    I041_MEN_SGD = 985,
    R000_GENKAN_PK2 = 986,
    R000_GENKAN_LIT = 987,
    R001_FUSUMA_PK2 = 988,
    R001_FUSUMA_LIT = 989,
    R002_IZANAI_PK2 = 990,
    R002_IZANAI_LIT = 991,
    R003_OUSETSU_PK2 = 992,
    R003_OUSETSU_LIT = 993,
    R004_SEMAI_PK2 = 994,
    R004_SEMAI_LIT = 995,
    R005_MEN_PK2 = 996,
    R005_MEN_LIT = 997,
    R006_HAKONIWA_PK2 = 998,
    R006_HAKONIWA_LIT = 999,
    R007_TOMURAI_PK2 = 1000,
    R007_TOMURAI_LIT = 1001,
    R008_KAIROU_PK2 = 1002,
    R008_KAIROU_LIT = 1003,
    R009_NANDO_PK2 = 1004,
    R009_NANDO_LIT = 1005,
    R010_NINGYO_PK2 = 1006,
    R010_NINGYO_LIT = 1007,
    R011_GOIMON_PK2 = 1008,
    R011_GOIMON_LIT = 1009,
    R012_IMA_PK2 = 1010,
    R012_IMA_LIT = 1011,
    R013_ANUTSU_PK2 = 1012,
    R013_ANUTSU_LIT = 1013,
    R014_BUTSUMA_PK2 = 1014,
    R014_BUTSUMA_LIT = 1015,
    R015_KOUJI_PK2 = 1016,
    R015_KOUJI_LIT = 1017,
    R016_NAKANIWA_PK2 = 1018,
    R016_NAKANIWA_LIT = 1019,
    R017_KAIDAN_PK2 = 1020,
    R017_KAIDAN_LIT = 1021,
    R018_ZASHIKI_PK2 = 1022,
    R018_ZASHIKI_LIT = 1023,
    R019_ODOU_PK2 = 1024,
    R019_ODOU_LIT = 1025,
    R020_YANEURA_PK2 = 1026,
    R020_YANEURA_LIT = 1027,
    R021_URANIWA_PK2 = 1028,
    R021_URANIWA_LIT = 1029,
    R022_NAKASU_PK2 = 1030,
    R022_NAKASU_LIT = 1031,
    R023_IKESU_PK2 = 1032,
    R023_IKESU_LIT = 1033,
    R024_TSUKIMI_PK2 = 1034,
    R024_TSUKIMI_LIT = 1035,
    R025_SANDO_PK2 = 1036,
    R025_SANDO_LIT = 1037,
    R026_OYASHIRO_PK2 = 1038,
    R026_OYASHIRO_LIT = 1039,
    R027_WATARI_PK2 = 1040,
    R027_WATARI_LIT = 1041,
    R028_KEGARE1_PK2 = 1042,
    R028_KEGARE1_LIT = 1043,
    R029_KARAKURI_PK2 = 1044,
    R029_KARAKURI_LIT = 1045,
    R030_KEGARE2_PK2 = 1046,
    R030_KEGARE2_LIT = 1047,
    R031_IDOSOKO_PK2 = 1048,
    R031_IDOSOKO_LIT = 1049,
    R032_NAWADONO_PK2 = 1050,
    R032_NAWADONO_LIT = 1051,
    R033_MISOGI_PK2 = 1052,
    R033_MISOGI_LIT = 1053,
    R034_YOMI_PK2 = 1054,
    R034_YOMI_LIT = 1055,
    R035_KOTO_PK2 = 1056,
    R035_KOTO_LIT = 1057,
    R036_K_MEN_PK2 = 1058,
    R036_K_MEN_LIT = 1059,
    R037_FAR_DMY = 1060,
    R037_DMY = 1061,
    R038_TYOUBOU_PK2 = 1062,
    R038_TYOUBOU_LIT = 1063,
    R039_FAR_DMY = 1064,
    R039__DMY = 1065,
    R040_NINGYO_2_PK2 = 1066,
    R040_NINGYO_2_LIT = 1067,
    R041_HIKAE_PK2 = 1068,
    R041_HIKAE_LIT = 1069,
    F000_CLOCK_L_SGD = 1070,
    F001_CLOCK_S_SGD = 1071,
    F002_CLOCK_C_SGD = 1072,
    F003_BYOUBU_F_SGD = 1073,
    F004_MEN_SGD = 1074,
    F005_KABE_SGD = 1075,
    F006_NAWA0_SGD = 1076,
    F007_NAWA1_SGD = 1077,
    F008_NAWA2_SGD = 1078,
    F009_LIGHT_AKARI_SGD = 1079,
    F010_HASHIRA_SGD = 1080,
    F011_IDO_SGD = 1081,
    F012_SAVEPNT_SGD = 1082,
    F013_WAFUKU1_SGD = 1083,
    F014_WAFUKU2_SGD = 1084,
    F015_SISI_SGD = 1085,
    F016_SYOUDAI_SGD = 1086,
    F017_TANMONO_SGD = 1087,
    F018_JOMAE_SGD = 1088,
    F019_JOMAE_SGD = 1089,
    F020_KAGOME_SGD = 1090,
    F021_SUISYA_SGD = 1091,
    F022_BRIDGE1_SGD = 1092,
    F023_BRIDGE2_SGD = 1093,
    F024_SYOUJI_A_S_SGD = 1094,
    F025_SYOUJI_S_SGD = 1095,
    F026_SYOUJI_SGD = 1096,
    F027_SYOUJI_A_SGD = 1097,
    F028_HAND_MIRROR_SGD = 1098,
    F029_SYOUJI_A_SGD = 1099,
    F030_SYOUJI_SGD = 1100,
    F031_SYOUJI_SGD = 1101,
    F032_JOMAE_SGD = 1102,
    F033_NAWA_SGD = 1103,
    F034_AKARI_SGD = 1104,
    F035_FUTA_SGD = 1105,
    F036_WAFUKU_SGD = 1106,
    F037_BYOUBU_SGD = 1107,
    F038_HIKIDASHI_SGD = 1108,
    F039_BYOUBU_A_SGD = 1109,
    F040_DARK_AKARI_SGD = 1110,
    F041_MEN1_SGD = 1111,
    F042_MEN2_SGD = 1112,
    F043_MEN3_SGD = 1113,
    F044_MEN4_SGD = 1114,
    F045_TOBIRA1_SGD = 1115,
    F046_TOBIRA2_SGD = 1116,
    F047_HANDR_SGD = 1117,
    F048_FOOTR_SGD = 1118,
    F049_HEAD_SGD = 1119,
    F050_FOOTL_SGD = 1120,
    F051_HANDL_SGD = 1121,
    F052_TOUROU_SGD = 1122,
    F053_BYOUBU_M_SGD = 1123,
    F054_HIKIDO_SGD = 1124,
    F055_SYOUJI_A_S_SGD = 1125,
    F056_KAZARI_SGD = 1126,
    F057_NAWA0_SGD = 1127,
    F058_NAWA1_SGD = 1128,
    F059_NAWA2_SGD = 1129,
    F060_DMY = 1130,
    F061_NAWA_SGD = 1131,
    F062_AKARI_SGD = 1132,
    F063_LIGHT_AKARI_SGD = 1133,
    F064_DARK_AKARI_SGD = 1134,
    F065_KAMON_D5_SGD = 1135,
    F066_KAMON_D2_SGD = 1136,
    F067_KEKKON2_SGD = 1137,
    F068_KAMON_HAK_SGD = 1138,
    F069_KAMON1_SGD = 1139,
    F070_KAMON_D4_SGD = 1140,
    F071_AKASI_SGD = 1141,
    F072_KAN_MIZO_SGD = 1142,
    F073_MOON_SGD = 1143,
    F074_KAN_HAME_SGD = 1144,
    F075_SYOUJI_S_SGD = 1145,
    F076_TANA_SGD = 1146,
    F077_TOBIRA_R_SGD = 1147,
    F078_TOBIRA_L_SGD = 1148,
    F079_KEKKON1_SGD = 1149,
    F080_HAMEITA_SGD = 1150,
    F081_KYODAI_SGD = 1151,
    F082_KAGIBAN1_SGD = 1152,
    F083_KAGIBAN2_SGD = 1153,
    F084_DMY = 1154,
    F085_DMY = 1155,
    F086_DMY = 1156,
    F087_KAIDAN_SGD = 1157,
    F088_SAVEPNT2_SGD = 1158,
    F089_SAVEPNT3_SGD = 1159,
    F090_SAVEPNT4_SGD = 1160,
    F091_SAVEPNT5_SGD = 1161,
    F092_OFUDA1_SGD = 1162,
    F093_OFUDA2_SGD = 1163,
    F094_OFUDA3_SGD = 1164,
    F095_OFUDA4_SGD = 1165,
    F096_TOBIRA_R_SGD = 1166,
    F097_TOBIRA_L_SGD = 1167,
    F098_MEN_SGD = 1168,
    F099_KAKUSHI1_SGD = 1169,
    F100_KAKUSHI2_SGD = 1170,
    F101_TEMARI_SGD = 1171,
    F102_KAKUSHI_ANU_SGD = 1172,
    F103_GOSINKYOU_SGD = 1173,
    F104_HASHIRA_SGD = 1174,
    F105_K_MEN_SGD = 1175,
    F106_KAIDAN_SGD = 1176,
    F107_CANDOL_2_SGD = 1177,
    F108_ODOROKI_SGD = 1178,
    F109_CANDOL_1_SGD = 1179,
    F110_ZUSITO_L_SGD = 1180,
    F111_ZUSITO_R_SGD = 1181,
    F112_ZUSI_SGD = 1182,
    F113_NAWA_SGD = 1183,
    F114_KAIDAN_SGD = 1184,
    F115_KOKUSEKI_SGD = 1185,
    F116_OFUDA1_SGD = 1186,
    F117_OFUDA2_SGD = 1187,
    F118_OFUDA3_SGD = 1188,
    F119_OFUDA_KAI1_SGD = 1189,
    F120_OFUDA_KAI2_SGD = 1190,
    F121_OFUDA_KAI3_SGD = 1191,
    F122_K_KOKUSEKI_SGD = 1192,
    F123_MADO_SGD = 1193,
    F124_KAGE_SGD = 1194,
    F125_MEN_SGD = 1195,
    F126_KINKO_SGD = 1196,
    F127_NAWA1_SGD = 1197,
    F128_NAWA2_SGD = 1198,
    F129_NAWA3_SGD = 1199,
    F130_NAWA4_SGD = 1200,
    F131_NAWA5_SGD = 1201,
    F132_NAWA6_SGD = 1202,
    F133_NAWA7_SGD = 1203,
    F134_NAWA8_SGD = 1204,
    F135_NAWA2_SGD = 1205,
    F136_NAWA1_SGD = 1206,
    F137_NAWA10_SGD = 1207,
    F138_DENKYU_SGD = 1208,
    F139_DENKYU_SGD = 1209,
    F140_GAREKI_SGD = 1210,
    F141_TUITATE_SGD = 1211,
    F142_HAKO_FUTA_SGD = 1212,
    F143_NAZOKURO_SGD = 1213,
    F144_HAKO_FUTA_SGD = 1214,
    F145_IDO_FUTA_SGD = 1215,
    F146_DENKYU_SGD = 1216,
    F147_NIN_HED_SGD = 1217,
    F148_DENKYU_SGD = 1218,
    F149_CHIDAMARI_SGD = 1219,
    F150_ITA_SGD = 1220,
    F151_OKOTU_HAKO_SGD = 1221,
    F152__DMY = 1222,
    F153_SYOKUDAI_SGD = 1223,
    F154_BUTSU4_SGD = 1224,
    F155_BUTSU5_SGD = 1225,
    F156__DMY = 1226,
    F157__DMY = 1227,
    F158__DMY = 1228,
    F159__DMY = 1229,
    F160__DMY = 1230,
    F161__DMY = 1231,
    F162__DMY = 1232,
    F163__DMY = 1233,
    F164__DMY = 1234,
    F165_KEKKON3_SGD = 1235,
    F166_KEKKON4_SGD = 1236,
    F167_KEKKON5_SGD = 1237,
    F168_KEKKON6_SGD = 1238,
    D000_GEN1_SGD = 1239,
    D001_GEN2_SGD = 1240,
    D002_GEN_IZA_SGD = 1241,
    D003_GEN_SEM_N_SGD = 1242,
    D004_FUS_KAI_SGD = 1243,
    D005_FUS1_1_SGD = 1244,
    D006_FUS1_2_SGD = 1245,
    D007_FUS2_1_SGD = 1246,
    D008_FUS2_2_SGD = 1247,
    D009_FUS3_1_SGD = 1248,
    D010_FUS3_2_SGD = 1249,
    D011_KAGIBANGOU_SGD = 1250,
    D012_TYOUBOU1_SGD = 1251,
    D013_FUS_IZA_SGD = 1252,
    D014_IZA_OUS_SGD = 1253,
    D015_IMA_ANU_K_SGD = 1254,
    D016_OUS_ANU_SGD = 1255,
    D017_SEM_ANU_SGD = 1256,
    D018_HAHEN_NO_SGD = 1257,
    D019_MEN_HAK_SGD = 1258,
    D020_K_MEN_SEM1_SGD = 1259,
    D021_K_MEN_SEM_SGD = 1260,
    D022_HAK1_SGD = 1261,
    D023_KAI_NAN_SGD = 1262,
    D024_WAN_NAK_SGD = 1263,
    D025_WAN_GOI_SGD = 1264,
    D026_GEN_SEM2_SGD = 1265,
    D027_GOI_IMA_SGD = 1266,
    D028_IMA_ANU_SGD = 1267,
    D029_K_MEN_SEM2_SGD = 1268,
    D030_ANU1_SGD = 1269,
    D031_HAK_ANU_SGD = 1270,
    D032_HAK_BUT1_SGD = 1271,
    D033_HAK_BUT2_SGD = 1272,
    D034_SEM_MEN_SGD = 1273,
    D035_TOM_KAI_SGD = 1274,
    D036_KOU_WAT1_SGD = 1275,
    D037_TOM_NAK_SGD = 1276,
    D038_NAK_KAI_SGD = 1277,
    D039_KOU_WAT2_SGD = 1278,
    D040_NAK_NAK_SGD = 1279,
    D041_NAK_ODO1_SGD = 1280,
    D042_DMY = 1281,
    D043_BUT_KAI_SGD = 1282,
    D044_KAI_IKE_SGD = 1283,
    D045_TOM_KOU_SGD = 1284,
    D046_YAN_BUT1_SGD = 1285,
    D047_ANU_SEM_SGD = 1286,
    D048_IDO_IKE_SGD = 1287,
    D049_MEN_HAK_SGD = 1288,
    D050_IDO_TOR_SGD = 1289,
    D051_TOR_OYA1_SGD = 1290,
    D052_TOR_OYA2_SGD = 1291,
    D053_KOT_YAN_SGD = 1292,
    D054_WAN_GOI2_SGD = 1293,
    D055_DMY = 1294,
    D056_DMY = 1295,
    D057_DMY = 1296,
    D058_WAT_KAR1_SGD = 1297,
    D059_DMY = 1298,
    D060_DMY = 1299,
    D061_DMY = 1300,
    D062_DMY = 1301,
    D063_DMY = 1302,
    D064_DMY = 1303,
    D065_KAI_KOT_SGD = 1304,
    D066_KOTO1_SGD = 1305,
    D067_KAI1_SGD = 1306,
    D068_KAI2_SGD = 1307,
    D069_KAIR_TYO_SGD = 1308,
    D070_OUS_TYO_SGD = 1309,
    D071_TSU_TYO1_SGD = 1310,
    D072_TSU_TYO2_SGD = 1311,
    D073_KAID_TYO_SGD = 1312,
    D074_DMY = 1313,
    D075_YAN_BUT2_SGD = 1314,
    D076_DMY = 1315,
    D077_KAI_ZAS_SGD = 1316,
    D078_DMY = 1317,
    D079_DMY = 1318,
    D080_DMY = 1319,
    D081_DMY = 1320,
    D082_DMY = 1321,
    D083_DMY = 1322,
    D084_DMY = 1323,
    D085_DMY = 1324,
    D086_DMY = 1325,
    D087_DMY = 1326,
    D088_DMY = 1327,
    D089_DMY = 1328,
    D090_DMY = 1329,
    D091_DMY = 1330,
    D092_DMY = 1331,
    D093_KIN_KEG1_SGD = 1332,
    D094_KIN_KEG2_SGD = 1333,
    D095_IDO_KEG2_SGD = 1334,
    D096_NAW_KEG2_2_SGD = 1335,
    D097_NAW_TUM1_SGD = 1336,
    D098_NAW_TUM2_SGD = 1337,
    D099_YOM_TUM1_SGD = 1338,
    D100_YOM_TUM2_SGD = 1339,
    D101_NAK_ODO2_SGD = 1340,
    D102_WAT_KAR2_SGD = 1341,
    D103_IMA1_SGD = 1342,
    D104_DMY = 1343,
    D105_DMY = 1344,
    D106_DMY = 1345,
    D107_HAHEN_YES_SGD = 1346,
    D108_ZASIKI_SGD = 1347,
    D109_DMY = 1348,
    D110_NAW_KEG2_1_SGD = 1349,
    SSYSTEM_BD = 1350,
    SGY000_BD = 1351,
    SGY001_BD = 1352,
    SV000_MIKU_BD = 1353,
    SV001_MAFUYU_BD = 1354,
    SP000_KAMON_BD = 1355,
    SP001_NINGYOU_BD = 1356,
    SP002_BANGOU_BD = 1357,
    SP003_BUTUDAN_BD = 1358,
    SP004_ROUSOKU_BD = 1359,
    SP005_BONJI_BD = 1360,
    SP006_KANZASHI_BD = 1361,
    SP007_NAWA_BD = 1362,
    SG010_HENREI_BD = 1363,
    SG011_JYOREI_BD = 1364,
    SG012_SAKKAREI_BD = 1365,
    SG024_MEKAKUSHI_BD = 1366,
    SG018_MAYOIGO1_BD = 1367,
    SG023_MAYOIGO3_BD = 1368,
    SG022_MAYOIGO2_BD = 1369,
    SG016_MINREI_BD = 1370,
    SG033_MINTSUMA_BD = 1371,
    SG015_KOMUSO_BD = 1372,
    SG032_SHINKAN1_BD = 1373,
    SG034_SHINKAN2_BD = 1374,
    SG035_SHINKAN3_BD = 1375,
    SG036_SHINKAN4_BD = 1376,
    SG037_TOUSHU_BD = 1377,
    SG038_NAWAMIKO_BD = 1378,
    SG046_SYOUKI1_BD = 1379,
    SG039_MAGAONLY_BD = 1380,
    SG013_TENAGA_BD = 1381,
    SG020_SAKASA_BD = 1382,
    SG014_KAMIONNA_BD = 1383,
    SG021_KUBI_BD = 1384,
    SG019_BOUREI_BD = 1385,
    SG028_KOTOKO_BD = 1386,
    SG025_RTE_BD = 1387,
    SG031_HAIREI_BD = 1388,
    SG027_KONNA_BD = 1389,
    SE000_EVENT0_BD = 1390,
    SE000_GASAGOSO00_BD = 1391,
    SE001_GASAGOSO01_BD = 1392,
    SE002_HASHIRI_BD = 1393,
    SE003_KANE_BD = 1394,
    SE004_KOTOEND_BD = 1395,
    SE005_TOKEI_BD = 1396,
    SE006_TOKEIKANE_BD = 1397,
    SE007_YUKATATAKU_BD = 1398,
    SE000_BD = 1399,
    SE001_BD = 1400,
    SE002_BD = 1401,
    SE003_BD = 1402,
    SE005_BD = 1403,
    SE006_BD = 1404,
    SE007_BD = 1405,
    SE008_BD = 1406,
    SE009_BD = 1407,
    SE010_BD = 1408,
    SE011_BD = 1409,
    SE012_BD = 1410,
    SE014_BD = 1411,
    SE015_BD = 1412,
    SE016_BD = 1413,
    SE017_BD = 1414,
    SE018_BD = 1415,
    SE022_BD = 1416,
    SE023_BD = 1417,
    SE024_BD = 1418,
    SE025_BD = 1419,
    SE026_BD = 1420,
    SE027_BD = 1421,
    SE035_BD = 1422,
    SE038_BD = 1423,
    SR000_RARE0_BD = 1424,
    SJ000_JIDOU0_BD = 1425,
    SJ001_HENBYOU_BD = 1426,
    SJ004_HENDOOR_BD = 1427,
    SJ009_JOMIRROR_BD = 1428,
    SJ010_TSUMAKUBI_BD = 1429,
    SJ000_102_BD = 1430,
    SJ001_104_BD = 1431,
    SJ002_106_BD = 1432,
    SJ003_107_BD = 1433,
    SJ004_109_BD = 1434,
    SJ005_110_BD = 1435,
    SJ006_111_BD = 1436,
    SJ007_111_BD = 1437,
    SJ008_114_BD = 1438,
    SJ009_KIRIE_BD = 1439,
    SJ010_KOKIRIE_BD = 1440,
    SJ011_115_BD = 1441,
    SJ012_116_BD = 1442,
    SJ013_117_BD = 1443,
    SAF000_DOMA_BD = 1444,
    SAF001_GISHIKI_BD = 1445,
    SAF002_HASHIGO_BD = 1446,
    SAF003_ISHIDAN_BD = 1447,
    SAF004_ISHIDATAMI_BD = 1448,
    SAF005_ITA_K2_BD = 1449,
    SAF006_ITADAN_BD = 1450,
    SAF007_ITAHASHI_BD = 1451,
    SAF008_ITANOMA1_BD = 1452,
    SAF009_TANSUDAN_BD = 1453,
    SAF010_KAMOI_BD = 1454,
    SAF011_KISHIMI_BD = 1455,
    SAF012_KUSA_BD = 1456,
    SAF013_KUSA20_BD = 1457,
    SAF014_MIZU_BD = 1458,
    SAF015_NAWA_BD = 1459,
    SAF016_OCHIBA_BD = 1460,
    SAF017_TATAMI_BD = 1461,
    SAF018_TENHARI_BD = 1462,
    SAF019_TUKIMI_BD = 1463,
    SAF020_DOJARI_BD = 1464,
    SAF021_DOKATA_BD = 1465,
    SAF022_DOTAKE_BD = 1466,
    SAF023_DOYAWA_BD = 1467,
    SAF024_CHU2KAI_BD = 1468,
    SAF025_WATASHI_BD = 1469,
    SAF026_YANEURA1_BD = 1470,
    SAF027_YANEURA2_BD = 1471,
    SAD000_FUSUMA_BD = 1472,
    SAD001_ISHI_BD = 1473,
    SAD002_KAITEN_BD = 1474,
    SAD003_KIDO_BD = 1475,
    SAD004_KUGURI_BD = 1476,
    SAD005_RYOUTE_BD = 1477,
    SAD006_TYUU_BD = 1478,
    SS000_BUTUWIND_BD = 1479,
    SS001_HISO_BD = 1480,
    SS002_IDOWIND_BD = 1481,
    SS003_KIMONO00_BD = 1482,
    SS004_KIMONO01_BD = 1483,
    SS005_MIZUBE_BD = 1484,
    SS006_MUSHI_BD = 1485,
    SS007_NAWA00_BD = 1486,
    SS008_NAWA01_BD = 1487,
    SS009_RAIMEI00_BD = 1488,
    SS010_RAIMEI01_BD = 1489,
    SS011_SORAUNARI_BD = 1490,
    SS012_SUISYA_BD = 1491,
    SS013_SUITEKI_BD = 1492,
    SS014_SUKIMAWIND_BD = 1493,
    SS000_BD = 1494,
    SS002_BD = 1495,
    SS003_BD = 1496,
    SS004_BD = 1497,
    SS007_BD = 1498,
    SS009_BD = 1499,
    SS010_BD = 1500,
    SS011_BD = 1501,
    SS012_BD = 1502,
    SS014_BD = 1503,
    SS015_BD = 1504,
    SS016_BD = 1505,
    SS020_BD = 1506,
    SS021_BD = 1507,
    SS022_BD = 1508,
    SS028_BD = 1509,
    SS029_BD = 1510,
    SS030_BD = 1511,
    SS041_BD = 1512,
    ST000_ZOU_OKU_BD = 1513,
    ST001_MEN_KAKE_BD = 1514,
    ST002_KAMON_HAME_BD = 1515,
    ST003_DBIG_AKANAI_BD = 1516,
    ST004_DMDL_AKANAI_BD = 1517,
    ST005_FUSUMA_AKANAI_BD = 1518,
    ST006_DMDL_KAGI_BD = 1519,
    ST007_DSML_KAGI_BD = 1520,
    ST008_KAGAMI_BD = 1521,
    ST009_KAMON_HAME_BD = 1522,
    ST010_KAMON_HIRAKI_BD = 1523,
    ST011_NAWA_KAKE_BD = 1524,
    ST012_OFUDA_BD = 1525,
    ST013_KAGAMI_ISHI_BD = 1526,
    ST014_NINGYOU_BD = 1527,
    AO000_TITLE_STR = 1528,
    AO001_STAFF_STR = 1529,
    AO002_SHOU_TITLE_STR = 1530,
    AO003_GAMEOVER_STR = 1531,
    AB000_STR = 1532,
    AB001_STR = 1533,
    AB002_STR = 1534,
    AB003_STR = 1535,
    AB004_STR = 1536,
    AB005_STR = 1537,
    AB010_STR = 1538,
    AB012_STR = 1539,
    AB013_STR = 1540,
    AB014_STR = 1541,
    AB015_STR = 1542,
    AB016_STR = 1543,
    AB018_STR = 1544,
    AB019_STR = 1545,
    AB026_STR = 1546,
    AB027_STR = 1547,
    AB028_STR = 1548,
    AB029_STR = 1549,
    AB030_STR = 1550,
    AE000_TAPE_STR = 1551,
    AE001_USIRO_STR = 1552,
    AE002_KOTO_STR = 1553,
    AE003_CHIKUONKI_STR = 1554,
    AE004_AYASHII_STR = 1555,
    AK000_IKESU_STR = 1556,
    AK001_KAZE_STR = 1557,
    AK002_NAKANIWA_STR = 1558,
    AK003_NAKASU_STR = 1559,
    AK004_SANDOU_STR = 1560,
    AK005_URANIWA_STR = 1561,
    AK006_AME_STR = 1562,
    AK007_KAMINARIFAR_STR = 1563,
    AY010_HENREI_STR = 1564,
    AY011_JYOREI_STR = 1565,
    AY012_SAKKAREI_STR = 1566,
    AY013_TENAGA_STR = 1567,
    AY014_KAMIONNA_STR = 1568,
    AY015_KOMUSO_STR = 1569,
    AY016_MINREI_STR = 1570,
    AY018_MAYOIGO1_STR = 1571,
    AY019_BOUREI_STR = 1572,
    AY020_SAKASA_STR = 1573,
    AY021_KUBI_STR = 1574,
    AY022_MAYOIGO2_STR = 1575,
    AY023_MAYOIGO3_STR = 1576,
    AY024_MEKAKUSHI_STR = 1577,
    AY025_RTE_STR = 1578,
    AY027_KONNA_STR = 1579,
    AY028_KOTOKO_STR = 1580,
    AY031_HAIREI_STR = 1581,
    AY032_SHINKAN1_STR = 1582,
    AY033_MINTSUMA_STR = 1583,
    AY037_TOUSHU_STR = 1584,
    AY038_NAWAMIKO_STR = 1585,
    AY039_MAGAONLY_STR = 1586,
    AY046_SYOUKI1_STR = 1587,
    AY_KIRIE_STR = 1588,
    AD010_HENREI_STR = 1589,
    AD011_JYOREI_STR = 1590,
    AD012_SAKKAREI00_STR = 1591,
    AD012_SAKKAREI01_STR = 1592,
    AD016_MINREI_STR = 1593,
    AD018_MAYOIGO1_STR = 1594,
    AD022_MAYOIGO2_STR = 1595,
    AD023_MAYOIGO3_STR = 1596,
    AD024_MEKAKUSHI_STR = 1597,
    AD032_SHINKAN1_STR = 1598,
    AD033_MINTSUMA_STR = 1599,
    AD034_SHINKAN2_STR = 1600,
    AD035_SHINKAN3_STR = 1601,
    AD036_SHINKAN4_STR = 1602,
    AD037_TOUSHU00_STR = 1603,
    AD037_TOUSHU01_STR = 1604,
    AVMC000_KIRIE0_STR = 1605,
    AVMC001_KIRIE1_STR = 1606,
    AVMC002_KIRIE2_STR = 1607,
    AVMC003_MAHUYU0_STR = 1608,
    AVMC004_MAHUYU1_STR = 1609,
    AVMC005_MAHUYU2_STR = 1610,
    AVMC006_MIKU0_STR = 1611,
    AVMC007_MIKU1_STR = 1612,
    AVMC008_MIKU2_STR = 1613,
    AVMC009_MAFUYU3_STR = 1614,
    AVMC010_MAFUYU4_STR = 1615,
    AVMC011_MAFUYU5_STR = 1616,
    AVMC012_MAFUYU6_STR = 1617,
    AVMC020_KOROSHITA_STR = 1618,
    AVMC021_DOKONIIKUNO_STR = 1619,
    AVMC022_SAMUI_STR = 1620,
    AVMC023_MITAWAYO_STR = 1621,
    AVMC024_KAESHITE_STR = 1622,
    AVMC025_KOKONIITE_STR = 1623,
    AVMC026_NE_STR = 1624,
    AVMC027_DOUSHITE_STR = 1625,
    AVMC028_NAWAGA_STR = 1626,
    AVMC029_SUSURI1_STR = 1627,
    AVMC030_SUSURI2_STR = 1628,
    AVMC031_SUSURI3_STR = 1629,
    AVMC032_SUSURI4_STR = 1630,
    AVT000_OGATA0_STR = 1631,
    AVT001_OGATA1_STR = 1632,
    AVT002_HIRASAKA0_STR = 1633,
    AVT003_HIRASAKA1_STR = 1634,
    AVT004_HIRASAKA2_STR = 1635,
    AVT005_HIRASAKA3_STR = 1636,
    AVT006_TAKAMINE0_STR = 1637,
    AVT007_TAKAMINE1_STR = 1638,
    AVP000_STR = 1639,
    AVP001_STR = 1640,
    AVP002_STR = 1641,
    AVP003_STR = 1642,
    AVJS000_SAKKA00_STR = 1643,
    AVJS001_SAKKA01_STR = 1644,
    AVJS002_SAKKA02_STR = 1645,
    AVJS003_SAKKA03_STR = 1646,
    AVJS004_SAKKA04_STR = 1647,
    AVJS005_SAKKA05_STR = 1648,
    AVJS006_SAKKA06_STR = 1649,
    AVJS007_SAKKA07_STR = 1650,
    AVJS008_JOSYU00_STR = 1651,
    AVJS009_JOSYU01_STR = 1652,
    AVJS010_JOSYU02_STR = 1653,
    AVJS011_JOSYU03_STR = 1654,
    AVJS012_JOSYU04_STR = 1655,
    AVJS013_JOSYU05_STR = 1656,
    AVJS014_JOSYU06_STR = 1657,
    AVJS015_JOSYU07_STR = 1658,
    AVJS016_JOSYU08_STR = 1659,
    AVJS017_JOSYU09_STR = 1660,
    AVJS018_HEN00_STR = 1661,
    AVJS019_HEN01_STR = 1662,
    AVJS020_HEN02_STR = 1663,
    AVJS021_HEN03_STR = 1664,
    AVJS022_HEN04_STR = 1665,
    AVJS023_HEN05_STR = 1666,
    AVJS024_HEN06_STR = 1667,
    AVJS025_MINZOKU00_STR = 1668,
    AVJS026_MINZOKU01_STR = 1669,
    AVJS027_MINZOKU02_STR = 1670,
    AVJS028_MINZOKU03_STR = 1671,
    AVJS029_MINZOKU04_STR = 1672,
    AVJS030_MINZOKU05_STR = 1673,
    AVJS031_MINZOKU06_STR = 1674,
    AVJS032_MINZOKU07_STR = 1675,
    AVJS033_MINZOKU08_STR = 1676,
    AVJS034_MINZOKU09_STR = 1677,
    AVJS035_MINZOKU10_STR = 1678,
    AVJS036_MINZOKU11_STR = 1679,
    AVJS037_MAYOIGO00_STR = 1680,
    AVJS038_MAYOIGO01_STR = 1681,
    AVJS039_MAYOIGO02_STR = 1682,
    AVJS040_MAYOIGO03_STR = 1683,
    AVJS041_MAYOIGO04_STR = 1684,
    AVJS042_MAYOIGO05_STR = 1685,
    AVJS043_MAYOIGO10_STR = 1686,
    AVJS044_MAYOIGO11_STR = 1687,
    AVJS045_MAYOIGO12_STR = 1688,
    AVJS046_MAYOIGO13_STR = 1689,
    AVJS047_MAYOIGO14_STR = 1690,
    AVJS048_MAYOIGO15_STR = 1691,
    AVJS049_MAYOIGO16_STR = 1692,
    AVJS050_MAYOIGO20_STR = 1693,
    AVJS051_MAYOIGO21_STR = 1694,
    AVJS052_MAYOIGO22_STR = 1695,
    AVJS053_HAHA00_STR = 1696,
    AVJS054_HAHA01_STR = 1697,
    AVJS055_HAHA02_STR = 1698,
    AVJS056_HAHA03_STR = 1699,
    AVJS057_HAHA04_STR = 1700,
    AVJS058_HAHA05_STR = 1701,
    AVJS059_HAHA06_STR = 1702,
    AVJS060_KOKIRIE00_STR = 1703,
    AVJS061_KOKIRIE01_STR = 1704,
    AVJS062_KOKIRIE02_STR = 1705,
    AVJS063_KOKIRIE03_STR = 1706,
    AVJS064_KOKIRIE04_STR = 1707,
    AVJS065_KOKIRIE05_STR = 1708,
    AVJS066_KOKIRIE06_STR = 1709,
    AVJS067_KOKIRIE07_STR = 1710,
    AVJS068_KOKIRIE08_STR = 1711,
    AVJS069_KOKIRIE09_STR = 1712,
    AVJS070_SHINKAN00_STR = 1713,
    AVJS071_SHINKAN01_STR = 1714,
    AVJS072_SHINKAN02_STR = 1715,
    AVJS073_SHINKAN03_STR = 1716,
    AVJS074_SHINKAN04_STR = 1717,
    AVJW000_SAKKA00_STR = 1718,
    AVJW001_SAKKA01_STR = 1719,
    AVJW002_SAKKA02_STR = 1720,
    AVJW003_SAKKA03_STR = 1721,
    AVJW004_SAKKA04_STR = 1722,
    AVJW005_SAKKA05_STR = 1723,
    AVJW006_SAKKA06_STR = 1724,
    AVJW007_SAKKA07_STR = 1725,
    AVJW008_JOSYU00_STR = 1726,
    AVJW009_JOSYU01_STR = 1727,
    AVJW010_JOSYU02_STR = 1728,
    AVJW011_JOSYU03_STR = 1729,
    AVJW012_JOSYU04_STR = 1730,
    AVJW013_JOSYU05_STR = 1731,
    AVJW014_JOSYU06_STR = 1732,
    AVJW015_JOSYU07_STR = 1733,
    AVJW016_JOSYU08_STR = 1734,
    AVJW017_JOSYU09_STR = 1735,
    AVJW018_SHINKAN00_STR = 1736,
    AVJW019_SHINKAN01_STR = 1737,
    AVJW020_SHINKAN02_STR = 1738,
    AVJW021_SHINKAN03_STR = 1739,
    AVJW022_SHINKAN04_STR = 1740,
    AVJW023_HEN00_STR = 1741,
    AVJW024_HEN01_STR = 1742,
    AVJW025_HEN02_STR = 1743,
    AVJW026_HEN03_STR = 1744,
    AVJW027_HEN04_STR = 1745,
    AVJW028_HEN05_STR = 1746,
    AVJW029_HEN06_STR = 1747,
    AVJW030_MINZOKU00_STR = 1748,
    AVJW031_MINZOKU01_STR = 1749,
    AVJW032_MINZOKU02_STR = 1750,
    AVJW033_MINZOKU03_STR = 1751,
    AVJW034_MINZOKU04_STR = 1752,
    AVJW035_MINZOKU05_STR = 1753,
    AVJW036_MINZOKU06_STR = 1754,
    AVJW037_MINZOKU07_STR = 1755,
    AVJW038_MINZOKU08_STR = 1756,
    AVJW039_MINZOKU09_STR = 1757,
    AVJW040_MINZOKU10_STR = 1758,
    AVJW041_MINZOKU11_STR = 1759,
    AVJW042_HAHA00_STR = 1760,
    AVJW043_HAHA01_STR = 1761,
    AVJW044_HAHA02_STR = 1762,
    AVJW045_HAHA03_STR = 1763,
    AVJW046_HAHA04_STR = 1764,
    AVJW047_HAHA05_STR = 1765,
    AVJW048_HAHA06_STR = 1766,
    AVJW049_MAYOIGO00_STR = 1767,
    AVJW050_MAYOIGO01_STR = 1768,
    AVJW051_MAYOIGO02_STR = 1769,
    AVJW052_MAYOIGO03_STR = 1770,
    AVJW053_MAYOIGO04_STR = 1771,
    AVJW054_MAYOIGO05_STR = 1772,
    AVJW055_MAYOIGO10_STR = 1773,
    AVJW056_MAYOIGO11_STR = 1774,
    AVJW057_MAYOIGO12_STR = 1775,
    AVJW058_MAYOIGO13_STR = 1776,
    AVJW059_MAYOIGO14_STR = 1777,
    AVJW060_MAYOIGO15_STR = 1778,
    AVJW061_MAYOIGO16_STR = 1779,
    AVJW062_MAYOIGO20_STR = 1780,
    AVJW063_MAYOIGO21_STR = 1781,
    AVJW064_MAYOIGO22_STR = 1782,
    AVJW065_KOKIRIE00_STR = 1783,
    AVJW066_KOKIRIE01_STR = 1784,
    AVJW067_KOKIRIE02_STR = 1785,
    AVJW068_KOKIRIE03_STR = 1786,
    AVJW069_KOKIRIE04_STR = 1787,
    AVJW070_KOKIRIE05_STR = 1788,
    AVJW071_KOKIRIE06_STR = 1789,
    AVJW072_KOKIRIE07_STR = 1790,
    AVJW073_KOKIRIE08_STR = 1791,
    AVJW074_KOKIRIE09_STR = 1792,
    AM000_MAGA_STR = 1793,
    AM001_MAGAIN_STR = 1794,
    SCENE0010_STR = 1795,
    SCENE0020_STR = 1796,
    SCENE0022_STR = 1797,
    SCENE0030_STR = 1798,
    SCENE0031_STR = 1799,
    SCENE1000_STR = 1800,
    SCENE1010_STR = 1801,
    SCENE1030_STR = 1802,
    SCENE1031_STR = 1803,
    SCENE1034_STR = 1804,
    SCENE1070_STR = 1805,
    SCENE1080_STR = 1806,
    SCENE1090_STR = 1807,
    SCENE1100_STR = 1808,
    SCENE1101_STR = 1809,
    SCENE1102_STR = 1810,
    SCENE1120_STR = 1811,
    SCENE1150_STR = 1812,
    SCENE1160_STR = 1813,
    SCENE1170_STR = 1814,
    SCENE1180_STR = 1815,
    SCENE1220_STR = 1816,
    SCENE1230_STR = 1817,
    SCENE1240_STR = 1818,
    SCENE1250_STR = 1819,
    SCENE1260_STR = 1820,
    SCENE1280_STR = 1821,
    SCENE1300_STR = 1822,
    SCENE1301_STR = 1823,
    SCENE1320_STR = 1824,
    SCENE1330_STR = 1825,
    SCENE1331_STR = 1826,
    SCENE1332_STR = 1827,
    SCENE1340_STR = 1828,
    SCENE1410_STR = 1829,
    SCENE2010_STR = 1830,
    SCENE2013_STR = 1831,
    SCENE2020_STR = 1832,
    SCENE2030_STR = 1833,
    SCENE2040_STR = 1834,
    SCENE2050_STR = 1835,
    SCENE2060_STR = 1836,
    SCENE2061_STR = 1837,
    SCENE2062_STR = 1838,
    SCENE2070_STR = 1839,
    SCENE2071_STR = 1840,
    SCENE2072_STR = 1841,
    SCENE2090_STR = 1842,
    SCENE2091_STR = 1843,
    SCENE2092_STR = 1844,
    SCENE2100_STR = 1845,
    SCENE2110_STR = 1846,
    SCENE2130_STR = 1847,
    SCENE2131_STR = 1848,
    SCENE2132_STR = 1849,
    SCENE2140_STR = 1850,
    SCENE2141_STR = 1851,
    SCENE2142_STR = 1852,
    SCENE2143_STR = 1853,
    SCENE2150_STR = 1854,
    SCENE2160_STR = 1855,
    SCENE2170_STR = 1856,
    SCENE2171_STR = 1857,
    SCENE3010_STR = 1858,
    SCENE3020_STR = 1859,
    SCENE3030_STR = 1860,
    SCENE3040_STR = 1861,
    SCENE3050_STR = 1862,
    SCENE3060_STR = 1863,
    SCENE3070_STR = 1864,
    SCENE3080_STR = 1865,
    SCENE3081_STR = 1866,
    SCENE3090_STR = 1867,
    SCENE3100_STR = 1868,
    SCENE3110_STR = 1869,
    SCENE4010_STR = 1870,
    SCENE4011_STR = 1871,
    SCENE4020_STR = 1872,
    SCENE4030_STR = 1873,
    SCENE4031_STR = 1874,
    SCENE4040_STR = 1875,
    SCENE4041_STR = 1876,
    SCENE4042_STR = 1877,
    SCENE4050_STR = 1878,
    SCENE4060_STR = 1879,
    SCENE4070_STR = 1880,
    SCENE4080_STR = 1881,
    SCENE4090_STR = 1882,
    SCENE4100_STR = 1883,
    SCENE4110_STR = 1884,
    SCENE4120_STR = 1885,
    SCENE5010_STR = 1886,
    SCENE5020_STR = 1887,
    SCENE4900_STR = 1888,
    SCENE4901_STR = 1889,
    SCENE9000_STR = 1890,
    SCENE9001_STR = 1891,
    SCENE1010_OLD_STR = 1892,
    SCENE1031_OLD_STR = 1893,
    SCENE1301_OLD_STR = 1894,
    SCENE1332_OLD_STR = 1895,
    RSHADE_SGD = 1896
};

typedef struct { // 0xc
    /* 0x0 */ u_short ll;
    /* 0x2 */ u_short lr;
    /* 0x4 */ u_short rl;
    /* 0x6 */ u_short rr;
    /* 0x8 */ u_short master_vol;
    /* 0xa */ u_short pan;
} ADPCM_POS_CALC;

enum ADPCM_CMD_TYPE {
    AC_NONE = 0,
    AC_PLAY = 1,
    AC_PRELOAD = 2,
    AC_STOP = 3,
    AC_PAUSE = 4,
    AC_RESTART = 5
};

extern IOP_STAT iop_stat;
extern IOP_MASTER_VOL iop_mv;

extern IOP_ADPCM iop_adpcm[2];

extern u_int se_start_flg;
extern u_int se_stop_flg;

void IAdpcmInit(int dev_init);
void IAdpcmCmd(IOP_COMMAND* icp);
void IAdpcmMain();
void IAdpcmMain2();

void IaSetSteMono();

void ISeInit(int mode);
void ISeCmd(IOP_COMMAND* icp);
void ISeMain();

void ICdvdInit(int reset);
void ICdvdCmd(IOP_COMMAND* icp);
void ICdvdMain();
void ICdvdBreak();

#endif
